{
  "title": "Essentials",
  "content": "Source: https://docs.langchain.com/langsmith/agent-builder-essentials\n\nTools, triggers, memory, sub-agents, and approvals—everything you need in one place.\n\nTools let your agents interact with your apps and services. Your agents can send emails, create calendar events, post messages, search the web, and more. Choose from built-in tools for Gmail, Slack, Google Calendar, GitHub, and many others.\n\nSee [Supported tools](/langsmith/agent-builder-tools) for a complete list.\n\nTriggers define when your agent should start running. You can connect your agent to external tools or time-based schedules, letting it respond automatically to messages, emails, or recurring events.\n\nHere are some popular ways to trigger your agent:\n\n<CardGroup cols={3}>\n  <Card title=\"Slack\" icon=\"slack\">\n    Activate your agent when messages are received in specific Slack channels.\n  </Card>\n\n<Card title=\"Gmail\" icon=\"envelope\">\n    Trigger your agent when emails are received.\n  </Card>\n\n<Card title=\"Cron schedules\" icon=\"clock\">\n    Run your agent on a time-based schedule for recurring tasks.\n  </Card>\n</CardGroup>\n\n## Memory and updates\n\nYour agents get smarter over time. They remember important information from previous conversations and can update themselves to work better.\n\n* Memory: Agents remember relevant details from past interactions, so they can make better decisions in future conversations.\n* Self-updates: Agents can add new tools, remove ones they don't need, or adjust their instructions to improve how they work.\n* What stays the same: Agents can't change their name, description, or the triggers that start them.\n\nAgent Builder supports custom models. You can override the default Anthropic or OpenAI model for a specific agent by editing the agent's settings:\n\n1. In the [LangSmith UI](https://smith.langchain.com), navigate to the agent you want to edit.\n2. Click on the <Icon icon=\"gear\" /> settings icon in the top right corner.\n3. In the **Model** section, select **+ Add custom model**.\n4. Enter the model ID, display name, base URL, and API key name and value.\n5. Click **Save**.\n\n<Note>\n  Custom models may not perform as well as built-in models. Test your custom model before using it in production.\n</Note>\n\nBuild complex agents by breaking big tasks into smaller, specialized helpers. Think of sub-agents as a team of specialists—each one handles a specific part of the job while working together with your main agent.\n\nThis approach makes it easier to build sophisticated systems. Instead of one agent trying to do everything, you can have specialized helpers that each excel at their part of the task.\n\nHere are some ways you might use sub-agents:\n\n* Split into sub-tasks: Have one agent fetch data, another summarize it, and a third format the results.\n* Specialized tools: Give different agents access to different tools based on what they need to do.\n* Independent work: Let sub-agents work on their own, then bring their results back to the main agent.\n\nStay in control of important decisions. You can set up your agent to pause and ask for your approval before taking certain actions. This ensures your agent handles most tasks automatically, while you retain oversight.\n\n### Setting up approval steps\n\n<Steps>\n  <Step title=\"Select a tool\">\n    When setting up your agent, choose the tool or action you want to review before it runs.\n  </Step>\n\n<Step title=\"Turn on approval\">\n    Find the approval option for that tool and switch it on.\n  </Step>\n\n<Step title=\"Agent waits for you\">\n    When your agent reaches that step, it will pause and wait for your approval before continuing.\n  </Step>\n</Steps>\n\n### What you can do when your agent pauses\n\nWhen your agent stops to ask for approval, you have three options:\n\n<CardGroup cols={3}>\n  <Card title=\"Accept\" icon=\"check\">\n    Give the green light and let your agent proceed with its plan.\n  </Card>\n\n<Card title=\"Edit\" icon=\"pen-to-square\">\n    Modify the agent's message or parameters before allowing it to continue.\n  </Card>\n\n<Card title=\"Send feedback\" icon=\"comment\">\n    Share feedback to help your agent learn and improve.\n  </Card>\n</CardGroup>\n\n* [Set up your workspace](/langsmith/agent-builder-setup)\n* [Connect apps and services](/langsmith/agent-builder-tools)\n* [Use remote connections](/langsmith/agent-builder-mcp-framework)\n* [Choose between workspace and private agents](/langsmith/agent-builder-workspace-vs-private)\n* [Call agents from your app](/langsmith/agent-builder-code)\n\n<Callout icon=\"pen-to-square\" iconType=\"regular\">\n  [Edit this page on GitHub](https://github.com/langchain-ai/docs/edit/main/src/langsmith/agent-builder-essentials.mdx) or [file an issue](https://github.com/langchain-ai/docs/issues/new/choose).\n</Callout>\n\n<Tip icon=\"terminal\" iconType=\"regular\">\n  [Connect these docs](/use-these-docs) to Claude, VSCode, and more via MCP for real-time answers.\n</Tip>",
  "code_samples": [],
  "headings": [
    {
      "level": "h2",
      "text": "Tools",
      "id": "tools"
    },
    {
      "level": "h2",
      "text": "Triggers",
      "id": "triggers"
    },
    {
      "level": "h2",
      "text": "Memory and updates",
      "id": "memory-and-updates"
    },
    {
      "level": "h2",
      "text": "Custom models",
      "id": "custom-models"
    },
    {
      "level": "h2",
      "text": "Sub-agents",
      "id": "sub-agents"
    },
    {
      "level": "h2",
      "text": "Human in the loop",
      "id": "human-in-the-loop"
    },
    {
      "level": "h3",
      "text": "Setting up approval steps",
      "id": "setting-up-approval-steps"
    },
    {
      "level": "h3",
      "text": "What you can do when your agent pauses",
      "id": "what-you-can-do-when-your-agent-pauses"
    },
    {
      "level": "h2",
      "text": "Next steps",
      "id": "next-steps"
    }
  ],
  "url": "llms-txt#essentials",
  "links": []
}