{
  "title": "Frequently Asked Questions",
  "content": "Source: https://docs.langchain.com/langsmith/pricing-faq\n\n## Questions and Answers\n\n### I've been using LangSmith since before pricing took effect for new users. When will pricing go into effect for my account?\n\nIf you've been using LangSmith already, your usage will be billable starting in July 2024. At that point if you want to add seats or use more than the monthly allotment of free traces, you will need to add a credit card to LangSmith or contact sales. If you are interested in the Enterprise plan with higher rate limits and special deployment options, you can learn more or make a purchase by [contacting our sales team](https://www.langchain.com/contact-sales).\n\n### Which plan is right for me?\n\nIf you're an individual developer, the Developer plan is a great choice for small projects.\n\nFor teams that want to collaborate in LangSmith, check out the Plus plan. **If you are an early-stage startup building an AI application**, you may be eligible for our Startup plan with discounted prices and a generous free monthly trace allotment. Please reach out via our [Startup Contact Form](https://airtable.com/app8ZrGLtHAtFVO1o/pagfLAmdTz4ep7TGu/form) for more details.\n\nIf you need more advanced administration, authentication and authorization, deployment options, support, or annual invoicing, the Enterprise plan is right for you. Please reach out via our [Sales Contact Form](https://www.langchain.com/contact-sales) for more details.\n\nA seat is a distinct user inside your organization. We consider the total number of users (including invited users) to determine the number of seats to bill.\n\nA trace is one complete invocation of your application chain or agent, evaluator run, or playground run. Here is an [example](https://smith.langchain.com/public/17c24270-9f74-47e7-b70c-d508afc448fa/r) of a single trace.\n\n### What is an Agent Run?\n\nAn Agent Run is one end-to-end invocation of a LangGraph agent deployed via LangSmith Deployment. Nodes and subgraphs within a single agent execution are not charged separately. Calls to other LangGraph agents (through RemoteGraph or the LangGraph SDK or the API directly) are charged separately, to the deployment that hosts the agent being called. An interrupt for human-in-the-loop creates a separate Agent Run when resuming.\n\nAgent Runs are billed at \\$0.005 each. For high-volume usage, please [contact our sales team](https://www.langchain.com/contact-sales) to discuss custom pricing options.\n\n### What is an ingested event?\n\nAn ingested event is any distinct, trace-related data sent to LangSmith. This includes:\n\n* Inputs, outputs and metadata sent at the start of a run step within a trace\n* Inputs, outputs and metadata sent at the end of a run step within a trace\n* Feedback on run steps or traces\n\n### I've hit my rate or usage limits. What can I do?\n\nWhen you first sign up for a LangSmith account, you get a Personal organization that is limited to 5000 monthly traces. To continue sending traces after reaching this limit, upgrade to the Developer or Plus plans by adding a credit card. Head to [Plans and Billing](https://smith.langchain.com/settings/payments) to upgrade.\n\nSimilarly, if you've hit the rate limits on your current plan, you can upgrade to a higher plan to get higher limits, or contact support via [support.langchain.com](https://support.langchain.com) with questions.\n\n### I have a developer account, can I upgrade my account to the Plus or Enterprise plan?\n\nYes, Developer plan users can easily upgrade to the Plus plan on the [Plans and Billing](https://smith.langchain.com/settings/payments) page. For the Enterprise plan, please [contact our sales team](https://www.langchain.com/contact-sales) to discuss your needs.\n\n### How does billing work?\n\nSeats are billed monthly on the first of the month. Additional seats purchased mid-month are pro-rated and billed within one day of the purchase. Seats removed mid-month will not be credited.\n\nAs long as you have a card on file in your account, we'll service your traces and bill you on the first of the month for traces that you submitted in the previous month. You will be able to set usage limits if you so choose to limit the maximum charges you could incur in any given month.\n\n### Can I limit how much I spend on tracing?\n\nYou can set limits on the number of traces that can be sent to LangSmith per month on the [Usage configuration](https://smith.langchain.com/settings/payments) page.\n\n<Note>\n  While we do show you the dollar value of your usage limit for convenience, this limit evaluated in terms of number of traces instead of dollar amount. For example, if you are approved for our startup plan tier where you are given a generous allotment of free traces, your usage limit will not automatically change.\n\nYou are not currently able to set a spend limit in the product.\n</Note>\n\n### How can I track my usage so far this month?\n\nUnder the Settings section for your Organization you will see subsection for **Usage**. There, you will be able to see a graph of the daily number of billable LangSmith traces from the last 30, 60, or 90 days. Note that this data is delayed by 1-2 hours and so may trail your actual number of runs slightly for the current day.\n\n### I have a question about my bill...\n\nCustomers on the Developer and Plus plan tiers should contact support via [support.langchain.com](https://support.langchain.com). Customers on the Enterprise plan should contact their sales representative directly.\n\nEnterprise plan customers are billed annually by invoice.\n\n### What can I expect from Support?\n\nOn the Developer plan, community-based support is available on [LangChain community Slack](https://www.langchain.com/join-community).\n\nOn the Plus plan, you will also receive preferential support via [support.langchain.com](https://support.langchain.com) for LangSmith-related questions only and we'll do our best to respond within the next business day.\n\nOn the Enterprise plan, you'll get white-glove support with a Slack channel, a dedicated customer success manager, and monthly check-ins to go over LangSmith and LangChain questions. We can help with anything from debugging, agent and RAG techniques, evaluation approaches, and cognitive architecture reviews. If you purchase the add-on to run LangSmith in your environment, we'll also support deployments and new releases with our infra engineering team on-call.\n\n### Where is my data stored?\n\nYou may choose to sign up in either the US or EU region. See the [cloud architecture reference](/langsmith/cloud#cloud-architecture-and-scalability) for more details. If you're on the Enterprise plan, we can deliver LangSmith to run on your kubernetes cluster in AWS, GCP, or Azure so that data never leaves your environment.\n\n### Which security frameworks is LangSmith compliant with?\n\nWe are SOC 2 Type II, GDPR, and HIPAA compliant.\n\nYou can request more information about our security policies and posture at [trust.langchain.com](https://trust.langchain.com). Please note we only enter into BAAs with customers on our Enterprise plan.\n\n### Will you train on the data that I send LangSmith?\n\nWe will not train on your data, and you own all rights to your data. See [LangSmith Terms of Service](https://langchain.dev/terms-of-service) for more information.\n\n<Callout icon=\"pen-to-square\" iconType=\"regular\">\n  [Edit this page on GitHub](https://github.com/langchain-ai/docs/edit/main/src/langsmith/pricing-faq.mdx) or [file an issue](https://github.com/langchain-ai/docs/issues/new/choose).\n</Callout>\n\n<Tip icon=\"terminal\" iconType=\"regular\">\n  [Connect these docs](/use-these-docs) to Claude, VSCode, and more via MCP for real-time answers.\n</Tip>",
  "code_samples": [],
  "headings": [
    {
      "level": "h2",
      "text": "Questions and Answers",
      "id": "questions-and-answers"
    },
    {
      "level": "h3",
      "text": "I've been using LangSmith since before pricing took effect for new users. When will pricing go into effect for my account?",
      "id": "i've-been-using-langsmith-since-before-pricing-took-effect-for-new-users.-when-will-pricing-go-into-effect-for-my-account?"
    },
    {
      "level": "h3",
      "text": "Which plan is right for me?",
      "id": "which-plan-is-right-for-me?"
    },
    {
      "level": "h3",
      "text": "What is a seat?",
      "id": "what-is-a-seat?"
    },
    {
      "level": "h3",
      "text": "What is a trace?",
      "id": "what-is-a-trace?"
    },
    {
      "level": "h3",
      "text": "What is an Agent Run?",
      "id": "what-is-an-agent-run?"
    },
    {
      "level": "h3",
      "text": "What is an ingested event?",
      "id": "what-is-an-ingested-event?"
    },
    {
      "level": "h3",
      "text": "I've hit my rate or usage limits. What can I do?",
      "id": "i've-hit-my-rate-or-usage-limits.-what-can-i-do?"
    },
    {
      "level": "h3",
      "text": "I have a developer account, can I upgrade my account to the Plus or Enterprise plan?",
      "id": "i-have-a-developer-account,-can-i-upgrade-my-account-to-the-plus-or-enterprise-plan?"
    },
    {
      "level": "h3",
      "text": "How does billing work?",
      "id": "how-does-billing-work?"
    },
    {
      "level": "h3",
      "text": "Can I limit how much I spend on tracing?",
      "id": "can-i-limit-how-much-i-spend-on-tracing?"
    },
    {
      "level": "h3",
      "text": "How can I track my usage so far this month?",
      "id": "how-can-i-track-my-usage-so-far-this-month?"
    },
    {
      "level": "h3",
      "text": "I have a question about my bill...",
      "id": "i-have-a-question-about-my-bill..."
    },
    {
      "level": "h3",
      "text": "What can I expect from Support?",
      "id": "what-can-i-expect-from-support?"
    },
    {
      "level": "h3",
      "text": "Where is my data stored?",
      "id": "where-is-my-data-stored?"
    },
    {
      "level": "h3",
      "text": "Which security frameworks is LangSmith compliant with?",
      "id": "which-security-frameworks-is-langsmith-compliant-with?"
    },
    {
      "level": "h3",
      "text": "Will you train on the data that I send LangSmith?",
      "id": "will-you-train-on-the-data-that-i-send-langsmith?"
    }
  ],
  "url": "llms-txt#frequently-asked-questions",
  "links": []
}