{
  "title": "LangSmith data plane",
  "content": "Source: https://docs.langchain.com/langsmith/data-plane\n\nThe *data plane* consists of your [Agent Servers](/langsmith/agent-server) (deployments), their supporting infrastructure, and the \"listener\" application that continuously polls for updates from the [LangSmith control plane](/langsmith/control-plane).\n\n## Server infrastructure\n\nIn addition to the [Agent Server](/langsmith/agent-server) itself, the following infrastructure components for each server are also included in the broad definition of \"data plane\":\n\n* **PostgreSQL**: persistence layer for user, run, and memory data.\n* **Redis**: communication and ephemeral metadata for workers.\n* **Secrets store**: secure management of environment secrets.\n* **Autoscalers**: scale server containers based on load.\n\n## \"Listener\" application\n\nThe data plane \"listener\" application periodically calls [control plane APIs](/langsmith/control-plane#control-plane-api) to:\n\n* Determine if new deployments should be created.\n* Determine if existing deployments should be updated (i.e. new revisions).\n* Determine if existing deployments should be deleted.\n\nIn other words, the data plane \"listener\" reads the latest state of the control plane (desired state) and takes action to reconcile outstanding deployments (current state) to match the latest state.\n\nPostgreSQL is the persistence layer for all user, run, and long-term memory data in a Agent Server. This stores both checkpoints (see more info [here](/oss/python/langgraph/persistence)), server resources (threads, runs, assistants and crons), as well as items saved in the long-term memory store (see more info [here](/oss/python/langgraph/persistence#memory-store)).\n\nRedis is used in each Agent Server as a way for server and queue workers to communicate, and to store ephemeral metadata. No user or run data is stored in Redis.\n\nAll runs in an Agent Server are executed by a pool of background workers that are part of each deployment. In order to enable some features for those runs (such as cancellation and output streaming) we need a channel for two-way communication between the server and the worker handling a particular run. We use Redis to organize that communication.\n\n1. A Redis list is used as a mechanism to wake up a worker as soon as a new run is created. Only a sentinel value is stored in this list, no actual run information. The run information is then retrieved from PostgreSQL by the worker.\n2. A combination of a Redis string and Redis PubSub channel is used for the server to communicate a run cancellation request to the appropriate worker.\n3. A Redis PubSub channel is used by the worker to broadcast streaming output from an agent while the run is being handled. Any open `/stream` request in the server will subscribe to that channel and forward any events to the response as they arrive. No events are stored in Redis at any time.\n\n### Ephemeral metadata\n\nRuns in an Agent Server may be retried for specific failures (currently only for transient PostgreSQL errors encountered during the run). In order to limit the number of retries (currently limited to 3 attempts per run) we record the attempt number in a Redis string when it is picked up. This contains no run-specific info other than its ID, and expires after a short delay.\n\n## Data plane features\n\nThis section describes various features of the data plane.\n\n<Info>\n  **Only for Cloud**\n  Data regions are only applicable for [Cloud](/langsmith/cloud) deployments.\n</Info>\n\nDeployments can be created in 2 data regions: US and EU\n\nThe data region for a deployment is implied by the data region of the LangSmith organization where the deployment is created. Deployments and the underlying database for the deployments cannot be migrated between data regions.\n\n[`Production` type](/langsmith/control-plane#deployment-types) deployments automatically scale up to 10 containers. Scaling is based on 3 metrics:\n\n1. CPU utilization\n2. Memory utilization\n3. Number of pending (in progress) [runs](/langsmith/assistants#execution)\n\nFor CPU utilization, the autoscaler targets 75% utilization. This means the autoscaler will scale the number of containers up or down to ensure that CPU utilization is at or near 75%. For memory utilization, the autoscaler targets 75% utilization as well.\n\nFor number of pending runs, the autoscaler targets 10 pending runs. For example, if the current number of containers is 1, but the number of pending runs is 20, the autoscaler will scale up the deployment to 2 containers (20 pending runs / 2 containers = 10 pending runs per container).\n\nEach metric is computed independently and the autoscaler will determine the scaling action based on the metric that results in the largest number of containers.\n\nScale down actions are delayed for 30 minutes before any action is taken. In other words, if the autoscaler decides to scale down a deployment, it will first wait for 30 minutes before scaling down. After 30 minutes, the metrics are recomputed and the deployment will scale down if the recomputed metrics result in a lower number of containers than the current number. Otherwise, the deployment remains scaled up. This \"cool down\" period ensures that deployments do not scale up and down too frequently.\n\n### Static IP addresses\n\n<Info>\n  **Only for Cloud**\n  Static IP addresses are only available for [Cloud](/langsmith/cloud) deployments.\n</Info>\n\nAll traffic from deployments created after January 6th 2025 will come through a NAT gateway. This NAT gateway will have several static IP addresses depending on the data region. Refer to the table below for the list of static IP addresses:\n\n| US             | EU             |\n| -------------- | -------------- |\n| 35.197.29.146  | 34.13.192.67   |\n| 34.145.102.123 | 34.147.105.64  |\n| 34.169.45.153  | 34.90.22.166   |\n| 34.82.222.17   | 34.147.36.213  |\n| 35.227.171.135 | 34.32.137.113  |\n| 34.169.88.30   | 34.91.238.184  |\n| 34.19.93.202   | 35.204.101.241 |\n| 34.19.34.50    | 35.204.48.32   |\n| 34.59.244.194  |                |\n| 34.9.99.224    |                |\n| 34.68.27.146   |                |\n| 34.41.178.137  |                |\n| 34.123.151.210 |                |\n| 34.135.61.140  |                |\n| 34.121.166.52  |                |\n| 34.31.121.70   |                |\n\n<Info>\n  **Only for Cloud**\n  Payload size restrictions are only applicable to [Cloud](/langsmith/cloud) deployments.\n</Info>\n\nThe maximum payload size for all requests sent to [Cloud](/langsmith/cloud) deployments is 25 MB. Attempting to send a request with a payload larger than 25 MB will result in a `413 Payload Too Large` error.\n\n### Custom PostgreSQL\n\n<Info>\n  Custom PostgreSQL instances are only available for [hybrid](/langsmith/hybrid) and [self-hosted](/langsmith/self-hosted) deployments.\n</Info>\n\nA custom PostgreSQL instance can be used instead of the [one automatically created by the control plane](/langsmith/control-plane#database-provisioning). Specify the [`POSTGRES_URI_CUSTOM`](/langsmith/env-var#postgres-uri-custom) environment variable to use a custom PostgreSQL instance.\n\nMultiple deployments can share the same PostgreSQL instance. For example, for `Deployment A`, `POSTGRES_URI_CUSTOM` can be set to `postgres://<user>:<password>@/<database_name_1>?host=<hostname_1>` and for `Deployment B`, `POSTGRES_URI_CUSTOM` can be set to `postgres://<user>:<password>@/<database_name_2>?host=<hostname_1>`. `<database_name_1>` and `database_name_2` are different databases within the same instance, but `<hostname_1>` is shared. **The same database cannot be used for separate deployments**.\n\n<Info>\n  Custom Redis instances are only available for [Hybrid](/langsmith/hybrid) and [Self-Hosted](/langsmith/self-hosted) deployments.\n</Info>\n\nA custom Redis instance can be used instead of the one automatically created by the control plane. Specify the [REDIS\\_URI\\_CUSTOM](/langsmith/env-var#redis-uri-custom) environment variable to use a custom Redis instance.\n\nMultiple deployments can share the same Redis instance. For example, for `Deployment A`, `REDIS_URI_CUSTOM` can be set to `redis://<hostname_1>:<port>/1` and for `Deployment B`, `REDIS_URI_CUSTOM` can be set to `redis://<hostname_1>:<port>/2`. `1` and `2` are different database numbers within the same instance, but `<hostname_1>` is shared. **The same database number cannot be used for separate deployments**.\n\n### LangSmith tracing\n\nAgent Server is automatically configured to send traces to LangSmith. See the table below for details with respect to each deployment option.\n\n| Cloud                                  | Hybrid                                                    | Self-Hosted                                                                                |\n| -------------------------------------- | --------------------------------------------------------- | ------------------------------------------------------------------------------------------ |\n| Required<br />Trace to LangSmith SaaS. | Optional<br />Disable tracing or trace to LangSmith SaaS. | Optional<br />Disable tracing, trace to LangSmith SaaS, or trace to Self-Hosted LangSmith. |\n\nAgent Server is automatically configured to report telemetry metadata for billing purposes. See the table below for details with respect to each deployment option.\n\n| Cloud                             | Hybrid                            | Self-Hosted                                                                                                              |\n| --------------------------------- | --------------------------------- | ------------------------------------------------------------------------------------------------------------------------ |\n| Telemetry sent to LangSmith SaaS. | Telemetry sent to LangSmith SaaS. | Self-reported usage (audit) for air-gapped license key.<br />Telemetry sent to LangSmith SaaS for LangSmith License Key. |\n\nAgent Server is automatically configured to perform license key validation. See the table below for details with respect to each deployment option.\n\n| Cloud                                               | Hybrid                                              | Self-Hosted                                                                      |\n| --------------------------------------------------- | --------------------------------------------------- | -------------------------------------------------------------------------------- |\n| LangSmith API Key validated against LangSmith SaaS. | LangSmith API Key validated against LangSmith SaaS. | Air-gapped license key or Platform License Key validated against LangSmith SaaS. |\n\n<Callout icon=\"pen-to-square\" iconType=\"regular\">\n  [Edit this page on GitHub](https://github.com/langchain-ai/docs/edit/main/src/langsmith/data-plane.mdx) or [file an issue](https://github.com/langchain-ai/docs/issues/new/choose).\n</Callout>\n\n<Tip icon=\"terminal\" iconType=\"regular\">\n  [Connect these docs](/use-these-docs) to Claude, VSCode, and more via MCP for real-time answers.\n</Tip>",
  "code_samples": [],
  "headings": [
    {
      "level": "h2",
      "text": "Server infrastructure",
      "id": "server-infrastructure"
    },
    {
      "level": "h2",
      "text": "\"Listener\" application",
      "id": "\"listener\"-application"
    },
    {
      "level": "h2",
      "text": "PostgreSQL",
      "id": "postgresql"
    },
    {
      "level": "h2",
      "text": "Redis",
      "id": "redis"
    },
    {
      "level": "h3",
      "text": "Communication",
      "id": "communication"
    },
    {
      "level": "h3",
      "text": "Ephemeral metadata",
      "id": "ephemeral-metadata"
    },
    {
      "level": "h2",
      "text": "Data plane features",
      "id": "data-plane-features"
    },
    {
      "level": "h3",
      "text": "Data region",
      "id": "data-region"
    },
    {
      "level": "h3",
      "text": "Autoscaling",
      "id": "autoscaling"
    },
    {
      "level": "h3",
      "text": "Static IP addresses",
      "id": "static-ip-addresses"
    },
    {
      "level": "h3",
      "text": "Payload size",
      "id": "payload-size"
    },
    {
      "level": "h3",
      "text": "Custom PostgreSQL",
      "id": "custom-postgresql"
    },
    {
      "level": "h3",
      "text": "Custom Redis",
      "id": "custom-redis"
    },
    {
      "level": "h3",
      "text": "LangSmith tracing",
      "id": "langsmith-tracing"
    },
    {
      "level": "h3",
      "text": "Telemetry",
      "id": "telemetry"
    },
    {
      "level": "h3",
      "text": "Licensing",
      "id": "licensing"
    }
  ],
  "url": "llms-txt#langsmith-data-plane",
  "links": []
}