{
  "title": "LangSmith control plane",
  "content": "Source: https://docs.langchain.com/langsmith/control-plane\n\nThe *control plane* is the part of LangSmith that manages deployments. It includes the control plane UI, where users create and update [Agent Servers](/langsmith/agent-server), and the control plane APIs, which support the UI and provide programmatic access.\n\nWhen you make an update through the control plane, the update is stored in control plane state. The [data plane](/langsmith/data-plane) “listener” polls for these updates by calling the control plane APIs.\n\nFrom the control plane UI, you can:\n\n* View a list of outstanding deployments.\n* View details of an individual deployment.\n* Create a new deployment.\n* Update a deployment.\n* Update environment variables for a deployment.\n* View build and server logs of a deployment.\n* View deployment metrics such as CPU and memory usage.\n* Delete a deployment.\n\nThe Control plane UI is embedded in [LangSmith](https://docs.smith.langchain.com).\n\nThis section describes the data model of the control plane API. The API is used to create, update, and delete deployments. See the [control plane API reference](/langsmith/api-ref-control-plane) for more details.\n\nAn integration is an abstraction for a `git` repository provider (e.g. GitHub). It contains all of the required metadata needed to connect with and deploy from a `git` repository.\n\nA deployment is an instance of an Agent Server. A single deployment can have many revisions.\n\nA revision is an iteration of a deployment. When a new deployment is created, an initial revision is automatically created. To deploy code changes or update secrets for a deployment, a new revision must be created.\n\nA listener is an instance of a [\"listener\" application](/langsmith/data-plane#”listener”-application). A listener contains metadata about the application (e.g. version) and metadata about the compute infrastructure where it can deploy to (e.g. Kubernetes namespaces).\n\nThe listener data model only applies for [Hybrid](/langsmith/hybrid) and [Self-Hosted](/langsmith/self-hosted) deployments.\n\n## Control plane features\n\nThis section describes various features of the control plane.\n\nFor simplicity, the control plane offers two deployment types with different resource allocations: `Development` and `Production`.\n\n| **Deployment Type** | **CPU/Memory**  | **Scaling**       | **Database**                                                                     |\n| ------------------- | --------------- | ----------------- | -------------------------------------------------------------------------------- |\n| Development         | 1 CPU, 1 GB RAM | Up to 1 replica   | 10 GB disk, no backups                                                           |\n| Production          | 2 CPU, 2 GB RAM | Up to 10 replicas | Autoscaling disk, automatic backups, highly available (multi-zone configuration) |\n\nCPU and memory resources are per replica.\n\n<Warning>\n  **Immutable Deployment Type**\n  Once a deployment is created, the deployment type cannot be changed.\n</Warning>\n\n<Info>\n  **Self-Hosted Deployment**\n  Resources for [Hybrid](/langsmith/hybrid) and [Self-Hosted](/langsmith/self-hosted) deployments can be fully customized. Deployment types are only applicable for [Cloud](/langsmith/cloud) deployments.\n</Info>\n\n`Production` type deployments are suitable for \"production\" workloads. For example, select `Production` for customer-facing applications in the critical path.\n\nResources for `Production` type deployments can be manually increased on a case-by-case basis depending on use case and capacity constraints. Contact support via [support.langchain.com](https://support.langchain.com) to request an increase in resources.\n\n`Development` type deployments are suitable development and testing. For example, select `Development` for internal testing environments. `Development` type deployments are not suitable for \"production\" workloads.\n\n<Danger>\n  **Preemptible Compute Infrastructure**\n  `Development` type deployments (API server, queue server, and database) are provisioned on preemptible compute infrastructure. This means the compute infrastructure **may be terminated at any time without notice**. This may result in intermittent...\n\n* Redis connection timeouts/errors\n  * Postgres connection timeouts/errors\n  * Failed or retrying background runs\n\nThis behavior is expected. Preemptible compute infrastructure **significantly reduces the cost to provision a `Development` type deployment**. By design, Agent Server is fault-tolerant. The implementation will automatically attempt to recover from Redis/Postgres connection errors and retry failed background runs.\n\n`Production` type deployments are provisioned on durable compute infrastructure, not preemptible compute infrastructure.\n</Danger>\n\nDatabase disk size for `Development` type deployments can be manually increased on a case-by-case basis depending on use case and capacity constraints. For most use cases, [TTLs](/langsmith/configure-ttl) should be configured to manage disk usage. Contact support via [support.langchain.com](https://support.langchain.com) to request an increase in resources.\n\n### Database provisioning\n\nThe control plane and [data plane](/langsmith/data-plane) \"listener\" application coordinate to automatically create a Postgres database for each deployment. The database serves as the [persistence layer](/oss/python/langgraph/persistence#memory-store) for the deployment.\n\nWhen implementing a LangGraph application, a [checkpointer](/oss/python/langgraph/persistence#checkpointer-libraries) does not need to be configured by the developer. Instead, a checkpointer is automatically configured for the graph. Any checkpointer configured for a graph will be replaced by the one that is automatically configured.\n\nThere is no direct access to the database. All access to the database occurs through the [Agent Server](/langsmith/agent-server).\n\nThe database is never deleted until the deployment itself is deleted.\n\n<Info>\n  A custom Postgres instance can be configured for [Hybrid](/langsmith/hybrid) and [Self-Hosted](/langsmith/self-hosted) deployments.\n</Info>\n\n### Asynchronous deployment\n\nInfrastructure for deployments and revisions are provisioned and deployed asynchronously. They are not deployed immediately after submission. Currently, deployment can take up to several minutes.\n\n* When a new deployment is created, a new database is created for the deployment. Database creation is a one-time step. This step contributes to a longer deployment time for the initial revision of the deployment.\n* When a subsequent revision is created for a deployment, there is no database creation step. The deployment time for a subsequent revision is significantly faster compared to the deployment time of the initial revision.\n* The deployment process for each revision contains a build step, which can take up to a few minutes.\n\nThe control plane and [data plane](/langsmith/data-plane) \"listener\" application coordinate to achieve asynchronous deployments.\n\nAfter a deployment is ready, the control plane monitors the deployment and records various metrics, such as:\n\n* CPU and memory usage of the deployment.\n* Number of container restarts.\n* Number of replicas (this will increase with [autoscaling](/langsmith/data-plane#autoscaling)).\n* [PostgreSQL](/langsmith/data-plane#postgres) CPU, memory usage, and disk usage.\n* [Agent Server queue](/langsmith/agent-server#persistence-and-task-queue) pending/active run count.\n* [Agent Server API](/langsmith/agent-server) success response count, error response count, and latency.\n\nThese metrics are displayed as charts in the Control Plane UI.\n\n### LangSmith integration\n\nA [LangSmith](/langsmith/home) tracing project is automatically created for each deployment. The tracing project has the same name as the deployment. When creating a deployment, the `LANGCHAIN_TRACING` and `LANGSMITH_API_KEY`/`LANGCHAIN_API_KEY` environment variables do not need to be specified; they are set automatically by the control plane.\n\nWhen a deployment is deleted, the traces and the tracing project are not deleted.\n\n<Callout icon=\"pen-to-square\" iconType=\"regular\">\n  [Edit this page on GitHub](https://github.com/langchain-ai/docs/edit/main/src/langsmith/control-plane.mdx) or [file an issue](https://github.com/langchain-ai/docs/issues/new/choose).\n</Callout>\n\n<Tip icon=\"terminal\" iconType=\"regular\">\n  [Connect these docs](/use-these-docs) to Claude, VSCode, and more via MCP for real-time answers.\n</Tip>",
  "code_samples": [],
  "headings": [
    {
      "level": "h2",
      "text": "Control plane UI",
      "id": "control-plane-ui"
    },
    {
      "level": "h2",
      "text": "Control plane API",
      "id": "control-plane-api"
    },
    {
      "level": "h3",
      "text": "Integrations",
      "id": "integrations"
    },
    {
      "level": "h3",
      "text": "Deployments",
      "id": "deployments"
    },
    {
      "level": "h3",
      "text": "Revisions",
      "id": "revisions"
    },
    {
      "level": "h3",
      "text": "Listeners",
      "id": "listeners"
    },
    {
      "level": "h2",
      "text": "Control plane features",
      "id": "control-plane-features"
    },
    {
      "level": "h3",
      "text": "Deployment types",
      "id": "deployment-types"
    },
    {
      "level": "h3",
      "text": "Database provisioning",
      "id": "database-provisioning"
    },
    {
      "level": "h3",
      "text": "Asynchronous deployment",
      "id": "asynchronous-deployment"
    },
    {
      "level": "h3",
      "text": "Monitoring",
      "id": "monitoring"
    },
    {
      "level": "h3",
      "text": "LangSmith integration",
      "id": "langsmith-integration"
    }
  ],
  "url": "llms-txt#langsmith-control-plane",
  "links": []
}