{
  "title": "Philosophy",
  "content": "Source: https://docs.langchain.com/oss/python/langchain/philosophy\n\nLangChain exists to be the easiest place to start building with LLMs, while also being flexible and production-ready.\n\nLangChain is driven by a few core beliefs:\n\n* Large Language Models (LLMs) are great, powerful new technology.\n* LLMs are even better when you combine them with external sources of data.\n* LLMs will transform what the applications of the future look like. Specifically, the applications of the future will look more and more agentic.\n* It is still very early on in that transformation.\n* While it's easy to build a prototype of those agentic applications, it's still really hard to build agents that are reliable enough to put into production.\n\nWith LangChain, we have two core focuses:\n\n<Steps>\n  <Step title=\"We want to enable developers to build with the best models.\">\n    Different providers expose different APIs, with different model parameters and different message formats.\n    Standardizing these model inputs and outputs is a core focus, making it easy for developer to easily change to the most recent state-of-the-art model, avoiding lock-in.\n  </Step>\n\n<Step title=\"We want to make it easy to use models to orchestrate more complex flows that interact with other data and computation.\">\n    Models should be used for more than just *text generation* - they should also be used to orchestrate more complex flows that interact with other data. LangChain makes it easy to define [tools](/oss/python/langchain/tools) that LLMs can use dynamically, as well as help with parsing of and access to unstructured data.\n  </Step>\n</Steps>\n\nGiven the constant rate of change in the field, LangChain has also evolved over time. Below is a brief timeline of how LangChain has changed over the years, evolving alongside what it means to build with LLMs:\n\n<Update label=\"2022-10-24\" description=\"v0.0.1\">\n  A month before ChatGPT, **LangChain was launched as a Python package**. It consisted of two main components:\n\n* LLM abstractions\n  * \"Chains\", or predetermined steps of computation to run, for common use cases. For example - RAG: run a retrieval step, then run a generation step.\n\nThe name LangChain comes from \"Language\" (like Language models) and \"Chains\".\n</Update>\n\n<Update label=\"2022-12\">\n  The first general purpose agents were added to LangChain.\n\nThese general purpose agents were based on the [ReAct paper](https://arxiv.org/abs/2210.03629) (ReAct standing for Reasoning and Acting). They used LLMs to generate JSON that represented tool calls, and then parsed that JSON to determine what tools to call.\n</Update>\n\n<Update label=\"2023-01\">\n  OpenAI releases a 'Chat Completion' API.\n\nPreviously, models took in strings and returned a string. In the ChatCompletions API, they evolved to take in a list of messages and return a message. Other model providers followed suit, and LangChain updated to work with lists of messages.\n</Update>\n\n<Update label=\"2023-01\">\n  LangChain releases a JavaScript version.\n\nLLMs and agents will change how applications are built and JavaScript is the language of application developers.\n</Update>\n\n<Update label=\"2023-02\">\n  **LangChain Inc. was formed as a company** around the open source LangChain project.\n\nThe main goal was to \"make intelligent agents ubiquitous\". The team recognized that while LangChain was a key part (LangChain made it simple to get started with LLMs), there was also a need for other components.\n</Update>\n\n<Update label=\"2023-03\">\n  OpenAI releases 'function calling' in their API.\n\nThis allowed the API to explicitly generate payloads that represented tool calls. Other model providers followed suit, and LangChain was updated to use this as the preferred method for tool calling (rather than parsing JSON).\n</Update>\n\n<Update label=\"2023-06\">\n  **LangSmith is released** as closed source platform by LangChain Inc., providing observability and evals\n\nThe main issue with building agents is getting them to be reliable, and LangSmith, which provides observability and evals, was built to solve that need. LangChain was updated to integrate seamlessly with LangSmith.\n</Update>\n\n<Update label=\"2024-01\" description=\"v0.1.0\">\n  **LangChain releases 0.1.0**, its first non-0.0.x.\n\nThe industry matured from prototypes to production, and as such, LangChain increased its focus on stability.\n</Update>\n\n<Update label=\"2024-02\">\n  **LangGraph is released** as an open-source library.\n\nThe original LangChain had two focuses: LLM abstractions, and high-level interfaces for getting started with common applications; however, it was missing a low-level orchestration layer that allowed developers to control the exact flow of their agent. Enter: LangGraph.\n\nWhen building LangGraph, we learned from lessons when building LangChain and added functionality we discovered was needed: streaming, durable execution, short-term memory, human-in-the-loop, and more.\n</Update>\n\n<Update label=\"2024-06\">\n  **LangChain has over 700 integrations.**\n\nIntegrations were split out of the core LangChain package, and either moved into their own standalone packages (for the core integrations) or `langchain-community`.\n</Update>\n\n<Update label=\"2024-10\">\n  LangGraph becomes the preferred way to build any AI application that is more than a single LLM call.\n\nAs developers tried to improve the reliability of their applications, they needed more control than the high-level interfaces provided. LangGraph provided that low-level flexibility. Most chains and agents were marked as deprecated in LangChain with guides on how to migrate them to LangGraph. There is still one high-level abstraction created in LangGraph: an agent abstraction. It is built on top of low-level LangGraph and has the same interface as the ReAct agents from LangChain.\n</Update>\n\n<Update label=\"2025-04\">\n  Model APIs become more multimodal.\n\nModels started to accept files, images, videos, and more. We updated the `langchain-core` message format accordingly to allow developers to specify these multimodal inputs in a standard way.\n</Update>\n\n<Update label=\"2025-10-20\" description=\"v1.0.0\">\n  **LangChain releases 1.0** with two major changes:\n\n1. Complete revamp of all chains and agents in `langchain`. All chains and agents are now replaced with only one high level abstraction: an agent abstraction built on top of LangGraph. This was the high-level abstraction that was originally created in LangGraph, but just moved to LangChain.\n\nFor users still using old LangChain chains/agents who do NOT want to upgrade (note: we recommend you do), you can continue using old LangChain by installing the `langchain-classic` package.\n\n2. A standard message content format: Model APIs evolved from returning messages with a simple content string to more complex output types - reasoning blocks, citations, server-side tool calls, etc. LangChain evolved its message formats to standardize these across providers.\n</Update>\n\n<Callout icon=\"pen-to-square\" iconType=\"regular\">\n  [Edit this page on GitHub](https://github.com/langchain-ai/docs/edit/main/src/oss/langchain/philosophy.mdx) or [file an issue](https://github.com/langchain-ai/docs/issues/new/choose).\n</Callout>\n\n<Tip icon=\"terminal\" iconType=\"regular\">\n  [Connect these docs](/use-these-docs) to Claude, VSCode, and more via MCP for real-time answers.\n</Tip>",
  "code_samples": [],
  "headings": [
    {
      "level": "h2",
      "text": "History",
      "id": "history"
    }
  ],
  "url": "llms-txt#philosophy",
  "links": []
}