{
  "title": "Regions FAQ",
  "content": "Source: https://docs.langchain.com/langsmith/regions-faq\n\n<Note>\n  See the [cloud architecture reference](/langsmith/cloud#architecture) for additional details.\n</Note>\n\n## Legal and compliance\n\n#### *What privacy and data protection frameworks does LangSmith, including its EU instance, comply with?*\n\nLangSmith complies with the General Data Protection Regulation (GDPR) and other laws and regulations applicable to the LangSmith service. We are also SOC 2 Type 2 certified and are HIPAA compliant. You can request more information about our security policies and posture at [trust.langchain.com](https://trust.langchain.com). If you would like to sign a Data Processing Addendum (DPA) with us, please contact support via [support.langchain.com](https://support.langchain.com). Please note we only enter into Business Associate Agreements (BAAs) with customers on our Enterprise plan.\n\n#### *My company isn't based in the EU, can I still have my data hosted there?*\n\nYes, you can host your LangSmith data in the EU instance independent of your location.\n\n#### *Do you have a legal entity in the EU that we can contract with?*\n\nWe do not have a legal entity in the EU for customer contracting today.\n\n#### *Do different legal terms apply if I choose the EU region?*\n\nThe terms are the same for the EU and US regions.\n\n#### *How do I use the EU instance?*\n\nFollow the instructions [here](/langsmith/create-account-api-key) to create an account and an API key (make sure to change the region to EU in the dropdown)\n\n#### *Are there any functional differences between US and EU cloud-managed LangSmith?*\n\nThere may be a small delay between launches to each region depending on the feature. Besides that, they are functionally equivalent - all features supported in the US are supported in the EU and vice versa.\n\n#### *Can an organization have workspaces in different regions?*\n\nLangSmith does not support this at the moment, but if you are interested, please contact support via [support.langchain.com](https://support.langchain.com) and share your use case.\n\n#### *Can I connect an EU organization to a US organization and share billing?*\n\nLangSmith does not support this at the moment, but if you are interested, please contact support via [support.langchain.com](https://support.langchain.com) and share your use case.\n\n#### *What data will be stored in my selected region?*\n\nSee the [cloud architecture reference](/langsmith/cloud#architecture) for details.\n\n#### *How can I see my organization's region?*\n\nCheck your URL - any organizations on [https://eu.smith.langchain.com](https://eu.smith.langchain.com) are in the EU, and any on [https://smith.langchain.com](https://smith.langchain.com) are in the US.\n\n#### *Can I switch my organization from the US to EU or vice versa?*\n\nWe do not support migration between regions at this time, but if you are interested in this feature, please contact support via [support.langchain.com](https://support.langchain.com).\n\n#### *Is the EU region available on all LangSmith plans?*\n\nYes, you can sign up for the EU region on all plans including free plans.\n\n#### *Is pricing different for the EU region compared to the US region?*\n\nNo, pricing is the same for the EU and US regions.\n\n#### *What currency is used for payment if I use the EU region?*\n\nAll LangSmith plans are paid in USD.\n\n<Callout icon=\"pen-to-square\" iconType=\"regular\">\n  [Edit this page on GitHub](https://github.com/langchain-ai/docs/edit/main/src/langsmith/regions-faq.mdx) or [file an issue](https://github.com/langchain-ai/docs/issues/new/choose).\n</Callout>\n\n<Tip icon=\"terminal\" iconType=\"regular\">\n  [Connect these docs](/use-these-docs) to Claude, VSCode, and more via MCP for real-time answers.\n</Tip>",
  "code_samples": [],
  "headings": [
    {
      "level": "h2",
      "text": "Legal and compliance",
      "id": "legal-and-compliance"
    },
    {
      "level": "h2",
      "text": "Features",
      "id": "features"
    },
    {
      "level": "h2",
      "text": "Plans and pricing",
      "id": "plans-and-pricing"
    }
  ],
  "url": "llms-txt#regions-faq",
  "links": []
}