{
  "url": "https://react.dev/learn/managing-state",
  "title": "Managing State",
  "content": "As your application grows, it helps to be more intentional about how your state is organized and how the data flows between your components. Redundant or duplicate state is a common source of bugs. In this chapter, you’ll learn how to structure your state well, how to keep your state update logic maintainable, and how to share state between distant components.\n\nWith React, you won’t modify the UI from code directly. For example, you won’t write commands like “disable the button”, “enable the button”, “show the success message”, etc. Instead, you will describe the UI you want to see for the different visual states of your component (“initial state”, “typing state”, “success state”), and then trigger the state changes in response to user input. This is similar to how designers think about UI.\n\nHere is a quiz form built using React. Note how it uses the status state variable to determine whether to enable or disable the submit button, and whether to show the success message instead.\n\nRead Reacting to Input with State to learn how to approach interactions with a state-driven mindset.\n\nStructuring state well can make a difference between a component that is pleasant to modify and debug, and one that is a constant source of bugs. The most important principle is that state shouldn’t contain redundant or duplicated information. If there’s unnecessary state, it’s easy to forget to update it, and introduce bugs!\n\nFor example, this form has a redundant fullName state variable:\n\nYou can remove it and simplify the code by calculating fullName while the component is rendering:\n\nThis might seem like a small change, but many bugs in React apps are fixed this way.\n\nRead Choosing the State Structure to learn how to design the state shape to avoid bugs.\n\nSometimes, you want the state of two components to always change together. To do it, remove state from both of them, move it to their closest common parent, and then pass it down to them via props. This is known as “lifting state up”, and it’s one of the most common things you will do writing React code.\n\nIn this example, only one panel should be active at a time. To achieve this, instead of keeping the active state inside each individual panel, the parent component holds the state and specifies the props for its children.\n\nRead Sharing State Between Components to learn how to lift state up and keep components in sync.\n\nWhen you re-render a component, React needs to decide which parts of the tree to keep (and update), and which parts to discard or re-create from scratch. In most cases, React’s automatic behavior works well enough. By default, React preserves the parts of the tree that “match up” with the previously rendered component tree.\n\nHowever, sometimes this is not what you want. In this chat app, typing a message and then switching the recipient does not reset the input. This can make the user accidentally send a message to the wrong person:\n\nReact lets you override the default behavior, and force a component to reset its state by passing it a different key, like <Chat key={email} />. This tells React that if the recipient is different, it should be considered a different Chat component that needs to be re-created from scratch with the new data (and UI like inputs). Now switching between the recipients resets the input field—even though you render the same component.\n\nRead Preserving and Resetting State to learn the lifetime of state and how to control it.\n\nComponents with many state updates spread across many event handlers can get overwhelming. For these cases, you can consolidate all the state update logic outside your component in a single function, called “reducer”. Your event handlers become concise because they only specify the user “actions”. At the bottom of the file, the reducer function specifies how the state should update in response to each action!\n\nRead Extracting State Logic into a Reducer to learn how to consolidate logic in the reducer function.\n\nUsually, you will pass information from a parent component to a child component via props. But passing props can become inconvenient if you need to pass some prop through many components, or if many components need the same information. Context lets the parent component make some information available to any component in the tree below it—no matter how deep it is—without passing it explicitly through props.\n\nHere, the Heading component determines its heading level by “asking” the closest Section for its level. Each Section tracks its own level by asking the parent Section and adding one to it. Every Section provides information to all components below it without passing props—it does that through context.\n\nRead Passing Data Deeply with Context to learn about using context as an alternative to passing props.\n\nReducers let you consolidate a component’s state update logic. Context lets you pass information deep down to other components. You can combine reducers and context together to manage state of a complex screen.\n\nWith this approach, a parent component with complex state manages it with a reducer. Other components anywhere deep in the tree can read its state via context. They can also dispatch actions to update that state.\n\nRead Scaling Up with Reducer and Context to learn how state management scales in a growing app.\n\nHead over to Reacting to Input with State to start reading this chapter page by page!\n\nOr, if you’re already familiar with these topics, why not read about Escape Hatches?",
  "headings": [
    {
      "level": "h1",
      "text": "Managing State",
      "id": ""
    },
    {
      "level": "h3",
      "text": "In this chapter",
      "id": ""
    },
    {
      "level": "h2",
      "text": "Reacting to input with state",
      "id": "reacting-to-input-with-state"
    },
    {
      "level": "h2",
      "text": "Ready to learn this topic?",
      "id": ""
    },
    {
      "level": "h2",
      "text": "Choosing the state structure",
      "id": "choosing-the-state-structure"
    },
    {
      "level": "h2",
      "text": "Ready to learn this topic?",
      "id": ""
    },
    {
      "level": "h2",
      "text": "Sharing state between components",
      "id": "sharing-state-between-components"
    },
    {
      "level": "h2",
      "text": "Ready to learn this topic?",
      "id": ""
    },
    {
      "level": "h2",
      "text": "Preserving and resetting state",
      "id": "preserving-and-resetting-state"
    },
    {
      "level": "h2",
      "text": "Ready to learn this topic?",
      "id": ""
    },
    {
      "level": "h2",
      "text": "Extracting state logic into a reducer",
      "id": "extracting-state-logic-into-a-reducer"
    },
    {
      "level": "h2",
      "text": "Ready to learn this topic?",
      "id": ""
    },
    {
      "level": "h2",
      "text": "Passing data deeply with context",
      "id": "passing-data-deeply-with-context"
    },
    {
      "level": "h2",
      "text": "Ready to learn this topic?",
      "id": ""
    },
    {
      "level": "h2",
      "text": "Scaling up with reducer and context",
      "id": "scaling-up-with-reducer-and-context"
    },
    {
      "level": "h2",
      "text": "Ready to learn this topic?",
      "id": ""
    },
    {
      "level": "h2",
      "text": "What’s next?",
      "id": "whats-next"
    }
  ],
  "code_samples": [],
  "patterns": [],
  "links": [
    "https://react.dev/learn",
    "https://react.dev/reference/react",
    "https://react.dev/learn/tutorial-tic-tac-toe",
    "https://react.dev/learn/thinking-in-react",
    "https://react.dev/learn/installation",
    "https://react.dev/learn/creating-a-react-app",
    "https://react.dev/learn/build-a-react-app-from-scratch",
    "https://react.dev/learn/add-react-to-an-existing-project",
    "https://react.dev/learn/setup",
    "https://react.dev/learn/editor-setup",
    "https://react.dev/learn/typescript",
    "https://react.dev/learn/react-developer-tools",
    "https://react.dev/learn/react-compiler",
    "https://react.dev/learn/react-compiler/introduction",
    "https://react.dev/learn/react-compiler/installation",
    "https://react.dev/learn/react-compiler/incremental-adoption",
    "https://react.dev/learn/react-compiler/debugging",
    "https://react.dev/learn/describing-the-ui",
    "https://react.dev/learn/your-first-component",
    "https://react.dev/learn/importing-and-exporting-components",
    "https://react.dev/learn/writing-markup-with-jsx",
    "https://react.dev/learn/javascript-in-jsx-with-curly-braces",
    "https://react.dev/learn/passing-props-to-a-component",
    "https://react.dev/learn/conditional-rendering",
    "https://react.dev/learn/rendering-lists",
    "https://react.dev/learn/keeping-components-pure",
    "https://react.dev/learn/understanding-your-ui-as-a-tree",
    "https://react.dev/learn/adding-interactivity",
    "https://react.dev/learn/responding-to-events",
    "https://react.dev/learn/state-a-components-memory",
    "https://react.dev/learn/render-and-commit",
    "https://react.dev/learn/state-as-a-snapshot",
    "https://react.dev/learn/queueing-a-series-of-state-updates",
    "https://react.dev/learn/updating-objects-in-state",
    "https://react.dev/learn/updating-arrays-in-state",
    "https://react.dev/learn/managing-state",
    "https://react.dev/learn/reacting-to-input-with-state",
    "https://react.dev/learn/choosing-the-state-structure",
    "https://react.dev/learn/sharing-state-between-components",
    "https://react.dev/learn/preserving-and-resetting-state",
    "https://react.dev/learn/extracting-state-logic-into-a-reducer",
    "https://react.dev/learn/passing-data-deeply-with-context",
    "https://react.dev/learn/scaling-up-with-reducer-and-context",
    "https://react.dev/learn/escape-hatches",
    "https://react.dev/learn/referencing-values-with-refs",
    "https://react.dev/learn/manipulating-the-dom-with-refs",
    "https://react.dev/learn/synchronizing-with-effects",
    "https://react.dev/learn/you-might-not-need-an-effect",
    "https://react.dev/learn/lifecycle-of-reactive-effects",
    "https://react.dev/learn/separating-events-from-effects",
    "https://react.dev/learn/removing-effect-dependencies",
    "https://react.dev/learn/reusing-logic-with-custom-hooks",
    "https://react.dev/reference/react-dom"
  ]
}