{
  "url": "https://react.dev/learn/responding-to-events",
  "title": "Responding to Events",
  "content": "React lets you add event handlers to your JSX. Event handlers are your own functions that will be triggered in response to interactions like clicking, hovering, focusing form inputs, and so on.\n\nTo add an event handler, you will first define a function and then pass it as a prop to the appropriate JSX tag. For example, here is a button that doesn’t do anything yet:\n\nYou can make it show a message when a user clicks by following these three steps:\n\nYou defined the handleClick function and then passed it as a prop to <button>. handleClick is an event handler. Event handler functions:\n\nBy convention, it is common to name event handlers as handle followed by the event name. You’ll often see onClick={handleClick}, onMouseEnter={handleMouseEnter}, and so on.\n\nAlternatively, you can define an event handler inline in the JSX:\n\nOr, more concisely, using an arrow function:\n\nAll of these styles are equivalent. Inline event handlers are convenient for short functions.\n\nFunctions passed to event handlers must be passed, not called. For example:\n\nThe difference is subtle. In the first example, the handleClick function is passed as an onClick event handler. This tells React to remember it and only call your function when the user clicks the button.\n\nIn the second example, the () at the end of handleClick() fires the function immediately during rendering, without any clicks. This is because JavaScript inside the JSX { and } executes right away.\n\nWhen you write code inline, the same pitfall presents itself in a different way:\n\nPassing inline code like this won’t fire on click—it fires every time the component renders:\n\nIf you want to define your event handler inline, wrap it in an anonymous function like so:\n\nRather than executing the code inside with every render, this creates a function to be called later.\n\nIn both cases, what you want to pass is a function:\n\nRead more about arrow functions.\n\nBecause event handlers are declared inside of a component, they have access to the component’s props. Here is a button that, when clicked, shows an alert with its message prop:\n\nThis lets these two buttons show different messages. Try changing the messages passed to them.\n\nOften you’ll want the parent component to specify a child’s event handler. Consider buttons: depending on where you’re using a Button component, you might want to execute a different function—perhaps one plays a movie and another uploads an image.\n\nTo do this, pass a prop the component receives from its parent as the event handler like so:\n\nHere, the Toolbar component renders a PlayButton and an UploadButton:\n\nFinally, your Button component accepts a prop called onClick. It passes that prop directly to the built-in browser <button> with onClick={onClick}. This tells React to call the passed function on click.\n\nIf you use a design system, it’s common for components like buttons to contain styling but not specify behavior. Instead, components like PlayButton and UploadButton will pass event handlers down.\n\nBuilt-in components like <button> and <div> only support browser event names like onClick. However, when you’re building your own components, you can name their event handler props any way that you like.\n\nBy convention, event handler props should start with on, followed by a capital letter.\n\nFor example, the Button component’s onClick prop could have been called onSmash:\n\nIn this example, <button onClick={onSmash}> shows that the browser <button> (lowercase) still needs a prop called onClick, but the prop name received by your custom Button component is up to you!\n\nWhen your component supports multiple interactions, you might name event handler props for app-specific concepts. For example, this Toolbar component receives onPlayMovie and onUploadImage event handlers:\n\nNotice how the App component does not need to know what Toolbar will do with onPlayMovie or onUploadImage. That’s an implementation detail of the Toolbar. Here, Toolbar passes them down as onClick handlers to its Buttons, but it could later also trigger them on a keyboard shortcut. Naming props after app-specific interactions like onPlayMovie gives you the flexibility to change how they’re used later.\n\nMake sure that you use the appropriate HTML tags for your event handlers. For example, to handle clicks, use <button onClick={handleClick}> instead of <div onClick={handleClick}>. Using a real browser <button> enables built-in browser behaviors like keyboard navigation. If you don’t like the default browser styling of a button and want to make it look more like a link or a different UI element, you can achieve it with CSS. Learn more about writing accessible markup.\n\nEvent handlers will also catch events from any children your component might have. We say that an event “bubbles” or “propagates” up the tree: it starts with where the event happened, and then goes up the tree.\n\nThis <div> contains two buttons. Both the <div> and each button have their own onClick handlers. Which handlers do you think will fire when you click a button?\n\nIf you click on either button, its onClick will run first, followed by the parent <div>’s onClick. So two messages will appear. If you click the toolbar itself, only the parent <div>’s onClick will run.\n\nAll events propagate in React except onScroll, which only works on the JSX tag you attach it to.\n\nEvent handlers receive an event object as their only argument. By convention, it’s usually called e, which stands for “event”. You can use this object to read information about the event.\n\nThat event object also lets you stop the propagation. If you want to prevent an event from reaching parent components, you need to call e.stopPropagation() like this Button component does:\n\nWhen you click on a button:\n\nAs a result of e.stopPropagation(), clicking on the buttons now only shows a single alert (from the <button>) rather than the two of them (from the <button> and the parent toolbar <div>). Clicking a button is not the same thing as clicking the surrounding toolbar, so stopping the propagation makes sense for this UI.\n\nIn rare cases, you might need to catch all events on child elements, even if they stopped propagation. For example, maybe you want to log every click to analytics, regardless of the propagation logic. You can do this by adding Capture at the end of the event name:\n\nEach event propagates in three phases:\n\nCapture events are useful for code like routers or analytics, but you probably won’t use them in app code.\n\nNotice how this click handler runs a line of code and then calls the onClick prop passed by the parent:\n\nYou could add more code to this handler before calling the parent onClick event handler, too. This pattern provides an alternative to propagation. It lets the child component handle the event, while also letting the parent component specify some additional behavior. Unlike propagation, it’s not automatic. But the benefit of this pattern is that you can clearly follow the whole chain of code that executes as a result of some event.\n\nIf you rely on propagation and it’s difficult to trace which handlers execute and why, try this approach instead.\n\nSome browser events have default behavior associated with them. For example, a <form> submit event, which happens when a button inside of it is clicked, will reload the whole page by default:\n\nYou can call e.preventDefault() on the event object to stop this from happening:\n\nDon’t confuse e.stopPropagation() and e.preventDefault(). They are both useful, but are unrelated:\n\nAbsolutely! Event handlers are the best place for side effects.\n\nUnlike rendering functions, event handlers don’t need to be pure, so it’s a great place to change something—for example, change an input’s value in response to typing, or change a list in response to a button press. However, in order to change some information, you first need some way to store it. In React, this is done by using state, a component’s memory. You will learn all about it on the next page.\n\nClicking this button is supposed to switch the page background between white and black. However, nothing happens when you click it. Fix the problem. (Don’t worry about the logic inside handleClick—that part is fine.)",
  "headings": [
    {
      "level": "h1",
      "text": "Responding to Events",
      "id": ""
    },
    {
      "level": "h3",
      "text": "You will learn",
      "id": ""
    },
    {
      "level": "h2",
      "text": "Adding event handlers",
      "id": "adding-event-handlers"
    },
    {
      "level": "h3",
      "text": "Pitfall",
      "id": ""
    },
    {
      "level": "h3",
      "text": "Reading props in event handlers",
      "id": "reading-props-in-event-handlers"
    },
    {
      "level": "h3",
      "text": "Passing event handlers as props",
      "id": "passing-event-handlers-as-props"
    },
    {
      "level": "h3",
      "text": "Naming event handler props",
      "id": "naming-event-handler-props"
    },
    {
      "level": "h3",
      "text": "Note",
      "id": ""
    },
    {
      "level": "h2",
      "text": "Event propagation",
      "id": "event-propagation"
    },
    {
      "level": "h3",
      "text": "Pitfall",
      "id": ""
    },
    {
      "level": "h3",
      "text": "Stopping propagation",
      "id": "stopping-propagation"
    },
    {
      "level": "h5",
      "text": "Deep Dive",
      "id": ""
    },
    {
      "level": "h4",
      "text": "Capture phase events",
      "id": "capture-phase-events"
    },
    {
      "level": "h3",
      "text": "Passing handlers as alternative to propagation",
      "id": "passing-handlers-as-alternative-to-propagation"
    },
    {
      "level": "h3",
      "text": "Preventing default behavior",
      "id": "preventing-default-behavior"
    },
    {
      "level": "h2",
      "text": "Can event handlers have side effects?",
      "id": "can-event-handlers-have-side-effects"
    },
    {
      "level": "h2",
      "text": "Recap",
      "id": "recap"
    },
    {
      "level": "h2",
      "text": "Try out some challenges",
      "id": "challenges"
    },
    {
      "level": "h4",
      "text": "Challenge 1 of 2: Fix an event handler",
      "id": "fix-an-event-handler"
    }
  ],
  "code_samples": [
    {
      "code": "<button onClick={function handleClick() {  alert('You clicked me!');}}>",
      "language": "jsx"
    },
    {
      "code": "<button onClick={() => {  alert('You clicked me!');}}>",
      "language": "jsx"
    },
    {
      "code": "// This alert fires when the component renders, not when clicked!<button onClick={alert('You clicked me!')}>",
      "language": "jsx"
    },
    {
      "code": "<button onClick={() => alert('You clicked me!')}>",
      "language": "jsx"
    },
    {
      "code": "<div onClickCapture={() => { /* this runs first */ }}>  <button onClick={e => e.stopPropagation()} />  <button onClick={e => e.stopPropagation()} /></div>",
      "language": "jsx"
    },
    {
      "code": "function Button({ onClick, children }) {  return (    <button onClick={e => {      e.stopPropagation();      onClick();    }}>      {children}    </button>  );}",
      "language": "jsx"
    }
  ],
  "patterns": [
    {
      "description": "Learn ReactAdding InteractivityResponding to EventsReact lets you add event handlers to your JSX. Event handlers are your own functions that will be triggered in response to interactions like clicking, hovering, focusing form inputs, and so on. You will learn Different ways to write an event handler How to pass event handling logic from a parent component How events propagate and how to stop them Adding event handlers To add an event handler, you will first define a function and then pass it as a prop to the appropriate JSX tag. For example, here is a button that doesn’t do anything yet: App.jsApp.jsReloadClearForkexport default function Button() { return ( <button> I don't do anything </button> ); } You can make it show a message when a user clicks by following these three steps: Declare a function called handleClick inside your Button component. Implement the logic inside that function (use alert to show the message). Add onClick={handleClick} to the <button> JSX. App.jsApp.jsReloadClearForkexport default function Button() { function handleClick() { alert('You clicked me!'); } return ( <button onClick={handleClick}> Click me </button> ); } You defined the handleClick function and then passed it as a prop to <button>. handleClick is an event handler. Event handler functions: Are usually defined inside your components. Have names that start with handle, followed by the name of the event. By convention, it is common to name event handlers as handle followed by the event name. You’ll often see onClick={handleClick}, onMouseEnter={handleMouseEnter}, and so on. Alternatively, you can define an event handler inline in the JSX: <button onClick={function handleClick() { alert('You clicked me!');}}> Or, more concisely, using an arrow function: <button onClick={() => { alert('You clicked me!');}}> All of these styles are equivalent. Inline event handlers are convenient for short functions. PitfallFunctions passed to event handlers must be passed, not called. For example:passing a function (correct)calling a function (incorrect)<button onClick={handleClick}><button onClick={handleClick()}>The difference is subtle. In the first example, the handleClick function is passed as an onClick event handler. This tells React to remember it and only call your function when the user clicks the button.In the second example, the () at the end of handleClick() fires the function immediately during rendering, without any clicks. This is because JavaScript inside the JSX { and } executes right away.When you write code inline, the same pitfall presents itself in a different way:passing a function (correct)calling a function (incorrect)<button onClick={() => alert('...')}><button onClick={alert('...')}>Passing inline code like this won’t fire on click—it fires every time the component renders:// This alert fires when the component renders, not when clicked!<button onClick={alert('You clicked me!')}>If you want to define your event handler inline, wrap it in an anonymous function like so:<button onClick={() => alert('You clicked me!')}>Rather than executing the code inside with every render, this creates a function to be called later.In both cases, what you want to pass is a function: <button onClick={handleClick}> passes the handleClick function. <button onClick={() => alert('...')}> passes the () => alert('...') function. Read more about arrow functions. Reading props in event handlers Because event handlers are declared inside of a component, they have access to the component’s props. Here is a button that, when clicked, shows an alert with its message prop: App.jsApp.jsReloadClearForkfunction AlertButton({ message, children }) { return ( <button onClick={() => alert(message)}> {children} </button> ); } export default function Toolbar() { return ( <div> <AlertButton message=\"Playing!\"> Play Movie </AlertButton> <AlertButton message=\"Uploading!\"> Upload Image </AlertButton> </div> ); } Show more This lets these two buttons show different messages. Try changing the messages passed to them. Passing event handlers as props Often you’ll want the parent component to specify a child’s event handler. Consider buttons: depending on where you’re using a Button component, you might want to execute a different function—perhaps one plays a movie and another uploads an image. To do this, pass a prop the component receives from its parent as the event handler like so: App.jsApp.jsReloadClearForkfunction Button({ onClick, children }) { return ( <button onClick={onClick}> {children} </button> ); } function PlayButton({ movieName }) { function handlePlayClick() { alert(`Playing ${movieName}!`); } return ( <Button onClick={handlePlayClick}> Play \"{movieName}\" </Button> ); } function UploadButton() { return ( <Button onClick={() => alert('Uploading!')}> Upload Image </Button> ); } export default function Toolbar() { return ( <div> <PlayButton movieName=\"Kiki's Delivery Service\" /> <UploadButton /> </div> ); } Show more Here, the Toolbar component renders a PlayButton and an UploadButton: PlayButton passes handlePlayClick as the onClick prop to the Button inside. UploadButton passes () => alert('Uploading!') as the onClick prop to the Button inside. Finally, your Button component accepts a prop called onClick. It passes that prop directly to the built-in browser <button> with onClick={onClick}. This tells React to call the passed function on click. If you use a design system, it’s common for components like buttons to contain styling but not specify behavior. Instead, components like PlayButton and UploadButton will pass event handlers down. Naming event handler props Built-in components like <button> and <div> only support browser event names like onClick. However, when you’re building your own components, you can name their event handler props any way that you like. By convention, event handler props should start with on, followed by a capital letter. For example, the Button component’s onClick prop could have been called onSmash: App.jsApp.jsReloadClearForkfunction Button({ onSmash, children }) { return ( <button onClick={onSmash}> {children} </button> ); } export default function App() { return ( <div> <Button onSmash={() => alert('Playing!')}> Play Movie </Button> <Button onSmash={() => alert('Uploading!')}> Upload Image </Button> </div> ); } Show more In this example, <button onClick={onSmash}> shows that the browser <button> (lowercase) still needs a prop called onClick, but the prop name received by your custom Button component is up to you! When your component supports multiple interactions, you might name event handler props for app-specific concepts. For example, this Toolbar component receives onPlayMovie and onUploadImage event handlers: App.jsApp.jsReloadClearForkexport default function App() { return ( <Toolbar onPlayMovie={() => alert('Playing!')} onUploadImage={() => alert('Uploading!')} /> ); } function Toolbar({ onPlayMovie, onUploadImage }) { return ( <div> <Button onClick={onPlayMovie}> Play Movie </Button> <Button onClick={onUploadImage}> Upload Image </Button> </div> ); } function Button({ onClick, children }) { return ( <button onClick={onClick}> {children} </button> ); } Show more Notice how the App component does not need to know what Toolbar will do with onPlayMovie or onUploadImage. That’s an implementation detail of the Toolbar. Here, Toolbar passes them down as onClick handlers to its Buttons, but it could later also trigger them on a keyboard shortcut. Naming props after app-specific interactions like onPlayMovie gives you the flexibility to change how they’re used later. NoteMake sure that you use the appropriate HTML tags for your event handlers. For example, to handle clicks, use <button onClick={handleClick}> instead of <div onClick={handleClick}>. Using a real browser <button> enables built-in browser behaviors like keyboard navigation. If you don’t like the default browser styling of a button and want to make it look more like a link or a different UI element, you can achieve it with CSS. Learn more about writing accessible markup. Event propagation Event handlers will also catch events from any children your component might have. We say that an event “bubbles” or “propagates” up the tree: it starts with where the event happened, and then goes up the tree. This <div> contains two buttons. Both the <div> and each button have their own onClick handlers. Which handlers do you think will fire when you click a button? App.jsApp.jsReloadClearForkexport default function Toolbar() { return ( <div className=\"Toolbar\" onClick={() => { alert('You clicked on the toolbar!'); }}> <button onClick={() => alert('Playing!')}> Play Movie </button> <button onClick={() => alert('Uploading!')}> Upload Image </button> </div> ); } If you click on either button, its onClick will run first, followed by the parent <div>’s onClick. So two messages will appear. If you click the toolbar itself, only the parent <div>’s onClick will run. PitfallAll events propagate in React except onScroll, which only works on the JSX tag you attach it to. Stopping propagation Event handlers receive an event object as their only argument. By convention, it’s usually called e, which stands for “event”. You can use this object to read information about the event. That event object also lets you stop the propagation. If you want to prevent an event from reaching parent components, you need to call e.stopPropagation() like this Button component does: App.jsApp.jsReloadClearForkfunction Button({ onClick, children }) { return ( <button onClick={e => { e.stopPropagation(); onClick(); }}> {children} </button> ); } export default function Toolbar() { return ( <div className=\"Toolbar\" onClick={() => { alert('You clicked on the toolbar!'); }}> <Button onClick={() => alert('Playing!')}> Play Movie </Button> <Button onClick={() => alert('Uploading!')}> Upload Image </Button> </div> ); } Show more When you click on a button: React calls the onClick handler passed to <button>. That handler, defined in Button, does the following: Calls e.stopPropagation(), preventing the event from bubbling further. Calls the onClick function, which is a prop passed from the Toolbar component. That function, defined in the Toolbar component, displays the button’s own alert. Since the propagation was stopped, the parent <div>’s onClick handler does not run. As a result of e.stopPropagation(), clicking on the buttons now only shows a single alert (from the <button>) rather than the two of them (from the <button> and the parent toolbar <div>). Clicking a button is not the same thing as clicking the surrounding toolbar, so stopping the propagation makes sense for this UI. Deep DiveCapture phase events Show DetailsIn rare cases, you might need to catch all events on child elements, even if they stopped propagation. For example, maybe you want to log every click to analytics, regardless of the propagation logic. You can do this by adding Capture at the end of the event name:<div onClickCapture={() => { /* this runs first */ }}> <button onClick={e => e.stopPropagation()} /> <button onClick={e => e.stopPropagation()} /></div>Each event propagates in three phases: It travels down, calling all onClickCapture handlers. It runs the clicked element’s onClick handler. It travels upwards, calling all onClick handlers. Capture events are useful for code like routers or analytics, but you probably won’t use them in app code. Passing handlers as alternative to propagation Notice how this click handler runs a line of code and then calls the onClick prop passed by the parent: function Button({ onClick, children }) { return ( <button onClick={e => { e.stopPropagation(); onClick(); }}> {children} </button> );} You could add more code to this handler before calling the parent onClick event handler, too. This pattern provides an alternative to propagation. It lets the child component handle the event, while also letting the parent component specify some additional behavior. Unlike propagation, it’s not automatic. But the benefit of this pattern is that you can clearly follow the whole chain of code that executes as a result of some event. If you rely on propagation and it’s difficult to trace which handlers execute and why, try this approach instead. Preventing default behavior Some browser events have default behavior associated with them. For example, a <form> submit event, which happens when a button inside of it is clicked, will reload the whole page by default: App.jsApp.jsReloadClearForkexport default function Signup() { return ( <form onSubmit={() => alert('Submitting!')}> <input /> <button>Send</button> </form> ); } You can call e.preventDefault() on the event object to stop this from happening: App.jsApp.jsReloadClearForkexport default function Signup() { return ( <form onSubmit={e => { e.preventDefault(); alert('Submitting!'); }}> <input /> <button>Send</button> </form> ); } Don’t confuse e.stopPropagation() and e.preventDefault(). They are both useful, but are unrelated: e.stopPropagation() stops the event handlers attached to the tags above from firing. e.preventDefault() prevents the default browser behavior for the few events that have it. Can event handlers have side effects? Absolutely! Event handlers are the best place for side effects. Unlike rendering functions, event handlers don’t need to be pure, so it’s a great place to change something—for example, change an input’s value in response to typing, or change a list in response to a button press. However, in order to change some information, you first need some way to store it. In React, this is done by using state, a component’s memory. You will learn all about it on the next page. Recap You can handle events by passing a function as a prop to an element like <button>. Event handlers must be passed, not called! onClick={handleClick}, not onClick={handleClick()}. You can define an event handler function separately or inline. Event handlers are defined inside a component, so they can access props. You can declare an event handler in a parent and pass it as a prop to a child. You can define your own event handler props with application-specific names. Events propagate upwards. Call e.stopPropagation() on the first argument to prevent that. Events may have unwanted default browser behavior. Call e.preventDefault() to prevent that. Explicitly calling an event handler prop from a child handler is a good alternative to propagation. Try out some challenges1. Fix an event handler 2. Wire up the events Challenge 1 of 2: Fix an event handler Clicking this button is supposed to switch the page background between white and black. However, nothing happens when you click it. Fix the problem. (Don’t worry about the logic inside handleClick—that part is fine.)App.jsApp.jsReloadClearForkexport default function LightSwitch() { function handleClick() { let bodyStyle = document.body.style; if (bodyStyle.backgroundColor === 'black') { bodyStyle.backgroundColor = 'white'; } else { bodyStyle.backgroundColor = 'black'; } } return ( <button onClick={handleClick()}> Toggle the lights </button> ); } Show more Show solutionNext ChallengePreviousAdding InteractivityNextState: A Component's Memory",
      "code": "export default function Button() {\n  return (\n    <button>\n      I don't do anything\n    </button>\n  );\n}"
    },
    {
      "description": "React lets you add event handlers to your JSX. Event handlers are your own functions that will be triggered in response to interactions like clicking, hovering, focusing form inputs, and so on. You will learn Different ways to write an event handler How to pass event handling logic from a parent component How events propagate and how to stop them Adding event handlers To add an event handler, you will first define a function and then pass it as a prop to the appropriate JSX tag. For example, here is a button that doesn’t do anything yet: App.jsApp.jsReloadClearForkexport default function Button() { return ( <button> I don't do anything </button> ); } You can make it show a message when a user clicks by following these three steps: Declare a function called handleClick inside your Button component. Implement the logic inside that function (use alert to show the message). Add onClick={handleClick} to the <button> JSX. App.jsApp.jsReloadClearForkexport default function Button() { function handleClick() { alert('You clicked me!'); } return ( <button onClick={handleClick}> Click me </button> ); } You defined the handleClick function and then passed it as a prop to <button>. handleClick is an event handler. Event handler functions: Are usually defined inside your components. Have names that start with handle, followed by the name of the event. By convention, it is common to name event handlers as handle followed by the event name. You’ll often see onClick={handleClick}, onMouseEnter={handleMouseEnter}, and so on. Alternatively, you can define an event handler inline in the JSX: <button onClick={function handleClick() { alert('You clicked me!');}}> Or, more concisely, using an arrow function: <button onClick={() => { alert('You clicked me!');}}> All of these styles are equivalent. Inline event handlers are convenient for short functions. PitfallFunctions passed to event handlers must be passed, not called. For example:passing a function (correct)calling a function (incorrect)<button onClick={handleClick}><button onClick={handleClick()}>The difference is subtle. In the first example, the handleClick function is passed as an onClick event handler. This tells React to remember it and only call your function when the user clicks the button.In the second example, the () at the end of handleClick() fires the function immediately during rendering, without any clicks. This is because JavaScript inside the JSX { and } executes right away.When you write code inline, the same pitfall presents itself in a different way:passing a function (correct)calling a function (incorrect)<button onClick={() => alert('...')}><button onClick={alert('...')}>Passing inline code like this won’t fire on click—it fires every time the component renders:// This alert fires when the component renders, not when clicked!<button onClick={alert('You clicked me!')}>If you want to define your event handler inline, wrap it in an anonymous function like so:<button onClick={() => alert('You clicked me!')}>Rather than executing the code inside with every render, this creates a function to be called later.In both cases, what you want to pass is a function: <button onClick={handleClick}> passes the handleClick function. <button onClick={() => alert('...')}> passes the () => alert('...') function. Read more about arrow functions. Reading props in event handlers Because event handlers are declared inside of a component, they have access to the component’s props. Here is a button that, when clicked, shows an alert with its message prop: App.jsApp.jsReloadClearForkfunction AlertButton({ message, children }) { return ( <button onClick={() => alert(message)}> {children} </button> ); } export default function Toolbar() { return ( <div> <AlertButton message=\"Playing!\"> Play Movie </AlertButton> <AlertButton message=\"Uploading!\"> Upload Image </AlertButton> </div> ); } Show more This lets these two buttons show different messages. Try changing the messages passed to them. Passing event handlers as props Often you’ll want the parent component to specify a child’s event handler. Consider buttons: depending on where you’re using a Button component, you might want to execute a different function—perhaps one plays a movie and another uploads an image. To do this, pass a prop the component receives from its parent as the event handler like so: App.jsApp.jsReloadClearForkfunction Button({ onClick, children }) { return ( <button onClick={onClick}> {children} </button> ); } function PlayButton({ movieName }) { function handlePlayClick() { alert(`Playing ${movieName}!`); } return ( <Button onClick={handlePlayClick}> Play \"{movieName}\" </Button> ); } function UploadButton() { return ( <Button onClick={() => alert('Uploading!')}> Upload Image </Button> ); } export default function Toolbar() { return ( <div> <PlayButton movieName=\"Kiki's Delivery Service\" /> <UploadButton /> </div> ); } Show more Here, the Toolbar component renders a PlayButton and an UploadButton: PlayButton passes handlePlayClick as the onClick prop to the Button inside. UploadButton passes () => alert('Uploading!') as the onClick prop to the Button inside. Finally, your Button component accepts a prop called onClick. It passes that prop directly to the built-in browser <button> with onClick={onClick}. This tells React to call the passed function on click. If you use a design system, it’s common for components like buttons to contain styling but not specify behavior. Instead, components like PlayButton and UploadButton will pass event handlers down. Naming event handler props Built-in components like <button> and <div> only support browser event names like onClick. However, when you’re building your own components, you can name their event handler props any way that you like. By convention, event handler props should start with on, followed by a capital letter. For example, the Button component’s onClick prop could have been called onSmash: App.jsApp.jsReloadClearForkfunction Button({ onSmash, children }) { return ( <button onClick={onSmash}> {children} </button> ); } export default function App() { return ( <div> <Button onSmash={() => alert('Playing!')}> Play Movie </Button> <Button onSmash={() => alert('Uploading!')}> Upload Image </Button> </div> ); } Show more In this example, <button onClick={onSmash}> shows that the browser <button> (lowercase) still needs a prop called onClick, but the prop name received by your custom Button component is up to you! When your component supports multiple interactions, you might name event handler props for app-specific concepts. For example, this Toolbar component receives onPlayMovie and onUploadImage event handlers: App.jsApp.jsReloadClearForkexport default function App() { return ( <Toolbar onPlayMovie={() => alert('Playing!')} onUploadImage={() => alert('Uploading!')} /> ); } function Toolbar({ onPlayMovie, onUploadImage }) { return ( <div> <Button onClick={onPlayMovie}> Play Movie </Button> <Button onClick={onUploadImage}> Upload Image </Button> </div> ); } function Button({ onClick, children }) { return ( <button onClick={onClick}> {children} </button> ); } Show more Notice how the App component does not need to know what Toolbar will do with onPlayMovie or onUploadImage. That’s an implementation detail of the Toolbar. Here, Toolbar passes them down as onClick handlers to its Buttons, but it could later also trigger them on a keyboard shortcut. Naming props after app-specific interactions like onPlayMovie gives you the flexibility to change how they’re used later. NoteMake sure that you use the appropriate HTML tags for your event handlers. For example, to handle clicks, use <button onClick={handleClick}> instead of <div onClick={handleClick}>. Using a real browser <button> enables built-in browser behaviors like keyboard navigation. If you don’t like the default browser styling of a button and want to make it look more like a link or a different UI element, you can achieve it with CSS. Learn more about writing accessible markup. Event propagation Event handlers will also catch events from any children your component might have. We say that an event “bubbles” or “propagates” up the tree: it starts with where the event happened, and then goes up the tree. This <div> contains two buttons. Both the <div> and each button have their own onClick handlers. Which handlers do you think will fire when you click a button? App.jsApp.jsReloadClearForkexport default function Toolbar() { return ( <div className=\"Toolbar\" onClick={() => { alert('You clicked on the toolbar!'); }}> <button onClick={() => alert('Playing!')}> Play Movie </button> <button onClick={() => alert('Uploading!')}> Upload Image </button> </div> ); } If you click on either button, its onClick will run first, followed by the parent <div>’s onClick. So two messages will appear. If you click the toolbar itself, only the parent <div>’s onClick will run. PitfallAll events propagate in React except onScroll, which only works on the JSX tag you attach it to. Stopping propagation Event handlers receive an event object as their only argument. By convention, it’s usually called e, which stands for “event”. You can use this object to read information about the event. That event object also lets you stop the propagation. If you want to prevent an event from reaching parent components, you need to call e.stopPropagation() like this Button component does: App.jsApp.jsReloadClearForkfunction Button({ onClick, children }) { return ( <button onClick={e => { e.stopPropagation(); onClick(); }}> {children} </button> ); } export default function Toolbar() { return ( <div className=\"Toolbar\" onClick={() => { alert('You clicked on the toolbar!'); }}> <Button onClick={() => alert('Playing!')}> Play Movie </Button> <Button onClick={() => alert('Uploading!')}> Upload Image </Button> </div> ); } Show more When you click on a button: React calls the onClick handler passed to <button>. That handler, defined in Button, does the following: Calls e.stopPropagation(), preventing the event from bubbling further. Calls the onClick function, which is a prop passed from the Toolbar component. That function, defined in the Toolbar component, displays the button’s own alert. Since the propagation was stopped, the parent <div>’s onClick handler does not run. As a result of e.stopPropagation(), clicking on the buttons now only shows a single alert (from the <button>) rather than the two of them (from the <button> and the parent toolbar <div>). Clicking a button is not the same thing as clicking the surrounding toolbar, so stopping the propagation makes sense for this UI. Deep DiveCapture phase events Show DetailsIn rare cases, you might need to catch all events on child elements, even if they stopped propagation. For example, maybe you want to log every click to analytics, regardless of the propagation logic. You can do this by adding Capture at the end of the event name:<div onClickCapture={() => { /* this runs first */ }}> <button onClick={e => e.stopPropagation()} /> <button onClick={e => e.stopPropagation()} /></div>Each event propagates in three phases: It travels down, calling all onClickCapture handlers. It runs the clicked element’s onClick handler. It travels upwards, calling all onClick handlers. Capture events are useful for code like routers or analytics, but you probably won’t use them in app code. Passing handlers as alternative to propagation Notice how this click handler runs a line of code and then calls the onClick prop passed by the parent: function Button({ onClick, children }) { return ( <button onClick={e => { e.stopPropagation(); onClick(); }}> {children} </button> );} You could add more code to this handler before calling the parent onClick event handler, too. This pattern provides an alternative to propagation. It lets the child component handle the event, while also letting the parent component specify some additional behavior. Unlike propagation, it’s not automatic. But the benefit of this pattern is that you can clearly follow the whole chain of code that executes as a result of some event. If you rely on propagation and it’s difficult to trace which handlers execute and why, try this approach instead. Preventing default behavior Some browser events have default behavior associated with them. For example, a <form> submit event, which happens when a button inside of it is clicked, will reload the whole page by default: App.jsApp.jsReloadClearForkexport default function Signup() { return ( <form onSubmit={() => alert('Submitting!')}> <input /> <button>Send</button> </form> ); } You can call e.preventDefault() on the event object to stop this from happening: App.jsApp.jsReloadClearForkexport default function Signup() { return ( <form onSubmit={e => { e.preventDefault(); alert('Submitting!'); }}> <input /> <button>Send</button> </form> ); } Don’t confuse e.stopPropagation() and e.preventDefault(). They are both useful, but are unrelated: e.stopPropagation() stops the event handlers attached to the tags above from firing. e.preventDefault() prevents the default browser behavior for the few events that have it. Can event handlers have side effects? Absolutely! Event handlers are the best place for side effects. Unlike rendering functions, event handlers don’t need to be pure, so it’s a great place to change something—for example, change an input’s value in response to typing, or change a list in response to a button press. However, in order to change some information, you first need some way to store it. In React, this is done by using state, a component’s memory. You will learn all about it on the next page. Recap You can handle events by passing a function as a prop to an element like <button>. Event handlers must be passed, not called! onClick={handleClick}, not onClick={handleClick()}. You can define an event handler function separately or inline. Event handlers are defined inside a component, so they can access props. You can declare an event handler in a parent and pass it as a prop to a child. You can define your own event handler props with application-specific names. Events propagate upwards. Call e.stopPropagation() on the first argument to prevent that. Events may have unwanted default browser behavior. Call e.preventDefault() to prevent that. Explicitly calling an event handler prop from a child handler is a good alternative to propagation. Try out some challenges1. Fix an event handler 2. Wire up the events Challenge 1 of 2: Fix an event handler Clicking this button is supposed to switch the page background between white and black. However, nothing happens when you click it. Fix the problem. (Don’t worry about the logic inside handleClick—that part is fine.)App.jsApp.jsReloadClearForkexport default function LightSwitch() { function handleClick() { let bodyStyle = document.body.style; if (bodyStyle.backgroundColor === 'black') { bodyStyle.backgroundColor = 'white'; } else { bodyStyle.backgroundColor = 'black'; } } return ( <button onClick={handleClick()}> Toggle the lights </button> ); } Show more Show solutionNext ChallengePreviousAdding InteractivityNextState: A Component's Memory",
      "code": "export default function Button() {\n  return (\n    <button>\n      I don't do anything\n    </button>\n  );\n}"
    },
    {
      "description": "React lets you add event handlers to your JSX. Event handlers are your own functions that will be triggered in response to interactions like clicking, hovering, focusing form inputs, and so on. You will learn Different ways to write an event handler How to pass event handling logic from a parent component How events propagate and how to stop them Adding event handlers To add an event handler, you will first define a function and then pass it as a prop to the appropriate JSX tag. For example, here is a button that doesn’t do anything yet: App.jsApp.jsReloadClearForkexport default function Button() { return ( <button> I don't do anything </button> ); } You can make it show a message when a user clicks by following these three steps: Declare a function called handleClick inside your Button component. Implement the logic inside that function (use alert to show the message). Add onClick={handleClick} to the <button> JSX. App.jsApp.jsReloadClearForkexport default function Button() { function handleClick() { alert('You clicked me!'); } return ( <button onClick={handleClick}> Click me </button> ); } You defined the handleClick function and then passed it as a prop to <button>. handleClick is an event handler. Event handler functions: Are usually defined inside your components. Have names that start with handle, followed by the name of the event. By convention, it is common to name event handlers as handle followed by the event name. You’ll often see onClick={handleClick}, onMouseEnter={handleMouseEnter}, and so on. Alternatively, you can define an event handler inline in the JSX: <button onClick={function handleClick() { alert('You clicked me!');}}> Or, more concisely, using an arrow function: <button onClick={() => { alert('You clicked me!');}}> All of these styles are equivalent. Inline event handlers are convenient for short functions. PitfallFunctions passed to event handlers must be passed, not called. For example:passing a function (correct)calling a function (incorrect)<button onClick={handleClick}><button onClick={handleClick()}>The difference is subtle. In the first example, the handleClick function is passed as an onClick event handler. This tells React to remember it and only call your function when the user clicks the button.In the second example, the () at the end of handleClick() fires the function immediately during rendering, without any clicks. This is because JavaScript inside the JSX { and } executes right away.When you write code inline, the same pitfall presents itself in a different way:passing a function (correct)calling a function (incorrect)<button onClick={() => alert('...')}><button onClick={alert('...')}>Passing inline code like this won’t fire on click—it fires every time the component renders:// This alert fires when the component renders, not when clicked!<button onClick={alert('You clicked me!')}>If you want to define your event handler inline, wrap it in an anonymous function like so:<button onClick={() => alert('You clicked me!')}>Rather than executing the code inside with every render, this creates a function to be called later.In both cases, what you want to pass is a function: <button onClick={handleClick}> passes the handleClick function. <button onClick={() => alert('...')}> passes the () => alert('...') function. Read more about arrow functions. Reading props in event handlers Because event handlers are declared inside of a component, they have access to the component’s props. Here is a button that, when clicked, shows an alert with its message prop: App.jsApp.jsReloadClearForkfunction AlertButton({ message, children }) { return ( <button onClick={() => alert(message)}> {children} </button> ); } export default function Toolbar() { return ( <div> <AlertButton message=\"Playing!\"> Play Movie </AlertButton> <AlertButton message=\"Uploading!\"> Upload Image </AlertButton> </div> ); } Show more This lets these two buttons show different messages. Try changing the messages passed to them. Passing event handlers as props Often you’ll want the parent component to specify a child’s event handler. Consider buttons: depending on where you’re using a Button component, you might want to execute a different function—perhaps one plays a movie and another uploads an image. To do this, pass a prop the component receives from its parent as the event handler like so: App.jsApp.jsReloadClearForkfunction Button({ onClick, children }) { return ( <button onClick={onClick}> {children} </button> ); } function PlayButton({ movieName }) { function handlePlayClick() { alert(`Playing ${movieName}!`); } return ( <Button onClick={handlePlayClick}> Play \"{movieName}\" </Button> ); } function UploadButton() { return ( <Button onClick={() => alert('Uploading!')}> Upload Image </Button> ); } export default function Toolbar() { return ( <div> <PlayButton movieName=\"Kiki's Delivery Service\" /> <UploadButton /> </div> ); } Show more Here, the Toolbar component renders a PlayButton and an UploadButton: PlayButton passes handlePlayClick as the onClick prop to the Button inside. UploadButton passes () => alert('Uploading!') as the onClick prop to the Button inside. Finally, your Button component accepts a prop called onClick. It passes that prop directly to the built-in browser <button> with onClick={onClick}. This tells React to call the passed function on click. If you use a design system, it’s common for components like buttons to contain styling but not specify behavior. Instead, components like PlayButton and UploadButton will pass event handlers down. Naming event handler props Built-in components like <button> and <div> only support browser event names like onClick. However, when you’re building your own components, you can name their event handler props any way that you like. By convention, event handler props should start with on, followed by a capital letter. For example, the Button component’s onClick prop could have been called onSmash: App.jsApp.jsReloadClearForkfunction Button({ onSmash, children }) { return ( <button onClick={onSmash}> {children} </button> ); } export default function App() { return ( <div> <Button onSmash={() => alert('Playing!')}> Play Movie </Button> <Button onSmash={() => alert('Uploading!')}> Upload Image </Button> </div> ); } Show more In this example, <button onClick={onSmash}> shows that the browser <button> (lowercase) still needs a prop called onClick, but the prop name received by your custom Button component is up to you! When your component supports multiple interactions, you might name event handler props for app-specific concepts. For example, this Toolbar component receives onPlayMovie and onUploadImage event handlers: App.jsApp.jsReloadClearForkexport default function App() { return ( <Toolbar onPlayMovie={() => alert('Playing!')} onUploadImage={() => alert('Uploading!')} /> ); } function Toolbar({ onPlayMovie, onUploadImage }) { return ( <div> <Button onClick={onPlayMovie}> Play Movie </Button> <Button onClick={onUploadImage}> Upload Image </Button> </div> ); } function Button({ onClick, children }) { return ( <button onClick={onClick}> {children} </button> ); } Show more Notice how the App component does not need to know what Toolbar will do with onPlayMovie or onUploadImage. That’s an implementation detail of the Toolbar. Here, Toolbar passes them down as onClick handlers to its Buttons, but it could later also trigger them on a keyboard shortcut. Naming props after app-specific interactions like onPlayMovie gives you the flexibility to change how they’re used later. NoteMake sure that you use the appropriate HTML tags for your event handlers. For example, to handle clicks, use <button onClick={handleClick}> instead of <div onClick={handleClick}>. Using a real browser <button> enables built-in browser behaviors like keyboard navigation. If you don’t like the default browser styling of a button and want to make it look more like a link or a different UI element, you can achieve it with CSS. Learn more about writing accessible markup. Event propagation Event handlers will also catch events from any children your component might have. We say that an event “bubbles” or “propagates” up the tree: it starts with where the event happened, and then goes up the tree. This <div> contains two buttons. Both the <div> and each button have their own onClick handlers. Which handlers do you think will fire when you click a button? App.jsApp.jsReloadClearForkexport default function Toolbar() { return ( <div className=\"Toolbar\" onClick={() => { alert('You clicked on the toolbar!'); }}> <button onClick={() => alert('Playing!')}> Play Movie </button> <button onClick={() => alert('Uploading!')}> Upload Image </button> </div> ); } If you click on either button, its onClick will run first, followed by the parent <div>’s onClick. So two messages will appear. If you click the toolbar itself, only the parent <div>’s onClick will run. PitfallAll events propagate in React except onScroll, which only works on the JSX tag you attach it to. Stopping propagation Event handlers receive an event object as their only argument. By convention, it’s usually called e, which stands for “event”. You can use this object to read information about the event. That event object also lets you stop the propagation. If you want to prevent an event from reaching parent components, you need to call e.stopPropagation() like this Button component does: App.jsApp.jsReloadClearForkfunction Button({ onClick, children }) { return ( <button onClick={e => { e.stopPropagation(); onClick(); }}> {children} </button> ); } export default function Toolbar() { return ( <div className=\"Toolbar\" onClick={() => { alert('You clicked on the toolbar!'); }}> <Button onClick={() => alert('Playing!')}> Play Movie </Button> <Button onClick={() => alert('Uploading!')}> Upload Image </Button> </div> ); } Show more When you click on a button: React calls the onClick handler passed to <button>. That handler, defined in Button, does the following: Calls e.stopPropagation(), preventing the event from bubbling further. Calls the onClick function, which is a prop passed from the Toolbar component. That function, defined in the Toolbar component, displays the button’s own alert. Since the propagation was stopped, the parent <div>’s onClick handler does not run. As a result of e.stopPropagation(), clicking on the buttons now only shows a single alert (from the <button>) rather than the two of them (from the <button> and the parent toolbar <div>). Clicking a button is not the same thing as clicking the surrounding toolbar, so stopping the propagation makes sense for this UI. Deep DiveCapture phase events Show DetailsIn rare cases, you might need to catch all events on child elements, even if they stopped propagation. For example, maybe you want to log every click to analytics, regardless of the propagation logic. You can do this by adding Capture at the end of the event name:<div onClickCapture={() => { /* this runs first */ }}> <button onClick={e => e.stopPropagation()} /> <button onClick={e => e.stopPropagation()} /></div>Each event propagates in three phases: It travels down, calling all onClickCapture handlers. It runs the clicked element’s onClick handler. It travels upwards, calling all onClick handlers. Capture events are useful for code like routers or analytics, but you probably won’t use them in app code. Passing handlers as alternative to propagation Notice how this click handler runs a line of code and then calls the onClick prop passed by the parent: function Button({ onClick, children }) { return ( <button onClick={e => { e.stopPropagation(); onClick(); }}> {children} </button> );} You could add more code to this handler before calling the parent onClick event handler, too. This pattern provides an alternative to propagation. It lets the child component handle the event, while also letting the parent component specify some additional behavior. Unlike propagation, it’s not automatic. But the benefit of this pattern is that you can clearly follow the whole chain of code that executes as a result of some event. If you rely on propagation and it’s difficult to trace which handlers execute and why, try this approach instead. Preventing default behavior Some browser events have default behavior associated with them. For example, a <form> submit event, which happens when a button inside of it is clicked, will reload the whole page by default: App.jsApp.jsReloadClearForkexport default function Signup() { return ( <form onSubmit={() => alert('Submitting!')}> <input /> <button>Send</button> </form> ); } You can call e.preventDefault() on the event object to stop this from happening: App.jsApp.jsReloadClearForkexport default function Signup() { return ( <form onSubmit={e => { e.preventDefault(); alert('Submitting!'); }}> <input /> <button>Send</button> </form> ); } Don’t confuse e.stopPropagation() and e.preventDefault(). They are both useful, but are unrelated: e.stopPropagation() stops the event handlers attached to the tags above from firing. e.preventDefault() prevents the default browser behavior for the few events that have it. Can event handlers have side effects? Absolutely! Event handlers are the best place for side effects. Unlike rendering functions, event handlers don’t need to be pure, so it’s a great place to change something—for example, change an input’s value in response to typing, or change a list in response to a button press. However, in order to change some information, you first need some way to store it. In React, this is done by using state, a component’s memory. You will learn all about it on the next page. Recap You can handle events by passing a function as a prop to an element like <button>. Event handlers must be passed, not called! onClick={handleClick}, not onClick={handleClick()}. You can define an event handler function separately or inline. Event handlers are defined inside a component, so they can access props. You can declare an event handler in a parent and pass it as a prop to a child. You can define your own event handler props with application-specific names. Events propagate upwards. Call e.stopPropagation() on the first argument to prevent that. Events may have unwanted default browser behavior. Call e.preventDefault() to prevent that. Explicitly calling an event handler prop from a child handler is a good alternative to propagation. Try out some challenges1. Fix an event handler 2. Wire up the events Challenge 1 of 2: Fix an event handler Clicking this button is supposed to switch the page background between white and black. However, nothing happens when you click it. Fix the problem. (Don’t worry about the logic inside handleClick—that part is fine.)App.jsApp.jsReloadClearForkexport default function LightSwitch() { function handleClick() { let bodyStyle = document.body.style; if (bodyStyle.backgroundColor === 'black') { bodyStyle.backgroundColor = 'white'; } else { bodyStyle.backgroundColor = 'black'; } } return ( <button onClick={handleClick()}> Toggle the lights </button> ); } Show more Show solutionNext Challenge",
      "code": "export default function Button() {\n  return (\n    <button>\n      I don't do anything\n    </button>\n  );\n}"
    },
    {
      "description": "You defined the handleClick function and then passed it as a prop to <button>. handleClick is an event handler. Event handler functions: Are usually defined inside your components. Have names that start with handle, followed by the name of the event. By convention, it is common to name event handlers as handle followed by the event name. You’ll often see onClick={handleClick}, onMouseEnter={handleMouseEnter}, and so on. Alternatively, you can define an event handler inline in the JSX: <button onClick={function handleClick() { alert('You clicked me!');}}> Or, more concisely, using an arrow function: <button onClick={() => { alert('You clicked me!');}}> All of these styles are equivalent. Inline event handlers are convenient for short functions. PitfallFunctions passed to event handlers must be passed, not called. For example:passing a function (correct)calling a function (incorrect)<button onClick={handleClick}><button onClick={handleClick()}>The difference is subtle. In the first example, the handleClick function is passed as an onClick event handler. This tells React to remember it and only call your function when the user clicks the button.In the second example, the () at the end of handleClick() fires the function immediately during rendering, without any clicks. This is because JavaScript inside the JSX { and } executes right away.When you write code inline, the same pitfall presents itself in a different way:passing a function (correct)calling a function (incorrect)<button onClick={() => alert('...')}><button onClick={alert('...')}>Passing inline code like this won’t fire on click—it fires every time the component renders:// This alert fires when the component renders, not when clicked!<button onClick={alert('You clicked me!')}>If you want to define your event handler inline, wrap it in an anonymous function like so:<button onClick={() => alert('You clicked me!')}>Rather than executing the code inside with every render, this creates a function to be called later.In both cases, what you want to pass is a function: <button onClick={handleClick}> passes the handleClick function. <button onClick={() => alert('...')}> passes the () => alert('...') function. Read more about arrow functions. Reading props in event handlers Because event handlers are declared inside of a component, they have access to the component’s props. Here is a button that, when clicked, shows an alert with its message prop:",
      "code": "handleClick"
    },
    {
      "description": "PitfallFunctions passed to event handlers must be passed, not called. For example:passing a function (correct)calling a function (incorrect)<button onClick={handleClick}><button onClick={handleClick()}>The difference is subtle. In the first example, the handleClick function is passed as an onClick event handler. This tells React to remember it and only call your function when the user clicks the button.In the second example, the () at the end of handleClick() fires the function immediately during rendering, without any clicks. This is because JavaScript inside the JSX { and } executes right away.When you write code inline, the same pitfall presents itself in a different way:passing a function (correct)calling a function (incorrect)<button onClick={() => alert('...')}><button onClick={alert('...')}>Passing inline code like this won’t fire on click—it fires every time the component renders:// This alert fires when the component renders, not when clicked!<button onClick={alert('You clicked me!')}>If you want to define your event handler inline, wrap it in an anonymous function like so:<button onClick={() => alert('You clicked me!')}>Rather than executing the code inside with every render, this creates a function to be called later.In both cases, what you want to pass is a function: <button onClick={handleClick}> passes the handleClick function. <button onClick={() => alert('...')}> passes the () => alert('...') function. Read more about arrow functions.",
      "code": "<button onClick={handleClick}>"
    }
  ],
  "links": [
    "https://react.dev/learn",
    "https://react.dev/reference/react",
    "https://react.dev/learn/tutorial-tic-tac-toe",
    "https://react.dev/learn/thinking-in-react",
    "https://react.dev/learn/installation",
    "https://react.dev/learn/creating-a-react-app",
    "https://react.dev/learn/build-a-react-app-from-scratch",
    "https://react.dev/learn/add-react-to-an-existing-project",
    "https://react.dev/learn/setup",
    "https://react.dev/learn/editor-setup",
    "https://react.dev/learn/typescript",
    "https://react.dev/learn/react-developer-tools",
    "https://react.dev/learn/react-compiler",
    "https://react.dev/learn/react-compiler/introduction",
    "https://react.dev/learn/react-compiler/installation",
    "https://react.dev/learn/react-compiler/incremental-adoption",
    "https://react.dev/learn/react-compiler/debugging",
    "https://react.dev/learn/describing-the-ui",
    "https://react.dev/learn/your-first-component",
    "https://react.dev/learn/importing-and-exporting-components",
    "https://react.dev/learn/writing-markup-with-jsx",
    "https://react.dev/learn/javascript-in-jsx-with-curly-braces",
    "https://react.dev/learn/passing-props-to-a-component",
    "https://react.dev/learn/conditional-rendering",
    "https://react.dev/learn/rendering-lists",
    "https://react.dev/learn/keeping-components-pure",
    "https://react.dev/learn/understanding-your-ui-as-a-tree",
    "https://react.dev/learn/adding-interactivity",
    "https://react.dev/learn/responding-to-events",
    "https://react.dev/learn/state-a-components-memory",
    "https://react.dev/learn/render-and-commit",
    "https://react.dev/learn/state-as-a-snapshot",
    "https://react.dev/learn/queueing-a-series-of-state-updates",
    "https://react.dev/learn/updating-objects-in-state",
    "https://react.dev/learn/updating-arrays-in-state",
    "https://react.dev/learn/managing-state",
    "https://react.dev/learn/reacting-to-input-with-state",
    "https://react.dev/learn/choosing-the-state-structure",
    "https://react.dev/learn/sharing-state-between-components",
    "https://react.dev/learn/preserving-and-resetting-state",
    "https://react.dev/learn/extracting-state-logic-into-a-reducer",
    "https://react.dev/learn/passing-data-deeply-with-context",
    "https://react.dev/learn/scaling-up-with-reducer-and-context",
    "https://react.dev/learn/escape-hatches",
    "https://react.dev/learn/referencing-values-with-refs",
    "https://react.dev/learn/manipulating-the-dom-with-refs",
    "https://react.dev/learn/synchronizing-with-effects",
    "https://react.dev/learn/you-might-not-need-an-effect",
    "https://react.dev/learn/lifecycle-of-reactive-effects",
    "https://react.dev/learn/separating-events-from-effects",
    "https://react.dev/learn/removing-effect-dependencies",
    "https://react.dev/learn/reusing-logic-with-custom-hooks",
    "https://react.dev/reference/react-dom/components/common",
    "https://react.dev/reference/react-dom"
  ]
}